Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/socket/index.po
Languages: es

source: socket --- Network Communication
es: socket --- Comunicaciones de Red

source: Provides access to network communication
es: Provee acceso a las comunicaciones de red

source: The ``socket`` module exposes the low-level C API for communicating over a network using the BSD socket interface. It includes the ``socket`` class, for handling the actual data channel, and also includes functions for network-related tasks such as converting a server's name to an address and formatting data to be sent across the network.
es: El módulo ``socket`` expone la API C de bajo nivel para comunicarse a través de una red utilizando la interfaz socket de BSD. Incluye la clase ``socket``, para manejar el canal de datos, e incluye también funciones para tareas relacionadas con la red, como la conversión del nombre de un servidor en una dirección y el formateo de datos a ser enviados a través de la red.

source: :pydoc:`socket`
es: :pydoc:`socker`

source: :ref:`Python 2 to 3 porting notes for socket <porting-socket>`
es: :ref:`Python 2 a 3 notas de puertos para socket <porting-socket>`

source: :mod:`select` -- Testing a socket to see if it is ready for reading or writing for non-blocking I/O.
es: :mod:`select` -- Prueba de un socket para ver si está listo para leer o escribir a E/O sin bloqueo.

source: :mod:`SocketServer` -- Framework for creating network servers.
es: :mod:`SocketServer` - Framework para crear servidores de red.

source: :mod:`asyncio` -- Asynchronous I/O and concurrency tools.
es: :mod:`asyncio` -- E/S Asíncronas y herramientas de concurrencia.

source: :mod:`urllib` and :mod:`urllib2` -- Most network clients should use the more convenient libraries for accessing remote resources through a URL.
es: :mod:`urllib` y :mod:`urllib2` -- La mayoría de los clientes de red deberían usar las librerías más convenientes para acceder a recursos remotos a través de una URL.

source: `Socket Programming HOWOTO <https://docs.python.org/3/howto/sockets.html>`__ -- An instructional guide by Gordon McMillan, included in the standard library documentation.
es: `Socket Programming HOWOTO <https://docs.python.org/3/howto/sockets.html>`__ -- Una guía de instrucciones de Gordon McMillan, incluida en la documentación de la librería estándar.

source: *Foundations of Python Network Programming, 3/E* -- By Brandon Rhodes and John Goerzen. Published by Apress, 2014. ISBN-10: 1430258543.
es: *Foundations of Python Network Programming, 3/E* - Por Brandon Rhodes y John Goerzen. Publicado por Apress, 2014. ISBN-10: 1430258543.

source: *Unix Network Programming, Volume 1: The Sockets Networking API, 3/E* -- By W. Richard Stevens, Bill Fenner, and Andrew M. Rudoff. Published by Addison-Wesley Professional, 2004. ISBN-10: 0131411551
es: *Unix Network Programming, Volume 1: The Sockets Networking API, 3/E* -- Por W. Richard Stevens, Bill Fenner, y Andrew M. Rudoff. Publicado por Addison-Wesley Professional, 2004. ISBN-10: 0131411551
