Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/socket/multicast.po
Languages: es

source: Multicast
es: Multidifusión (Multicast)

source: Point-to-point connections handle a lot of communication needs, but passing the same information between many peers becomes challenging as the number of direct connections grows. Sending messages separately to each recipient consumes additional processing time and bandwidth, which can be a problem for applications such as streaming video or audio. Using *multicast* to deliver messages to more than one endpoint at a time achieves better efficiency because the network infrastructure ensures that the packets are delivered to all recipients.
es: Las conexiones punto a punto manejan muchas necesidades de comunicación, pero pasar la misma información entre muchos pares se convierte en un desafío a medida que crece el número de conexiones directas. El envío de mensajes por separado a cada destinatario consume tiempo de procesamiento y ancho de banda adicionales, lo que puede ser un problema para aplicaciones como la transmisión de vídeo o audio. El uso de *multicast* para enviar mensajes a más de un punto final a la vez logra una mayor eficiencia porque la infraestructura de red garantiza que los paquetes se entregan a todos los destinatarios.

source: Multicast messages are always sent using UDP, since TCP assumes a pair of communicating systems. The addresses for multicast, called *multicast groups*, are a subset of regular IPv4 address range (224.0.0.0 through 230.255.255.255) reserved for multicast traffic. These addresses are treated specially by network routers and switches, so messages sent to the group can be distributed over the Internet to all recipients that have joined the group.
es: Los mensajes de multidifusión (multicast) se envían siempre usando UDP, ya que TCP asume un par de sistemas de comunicación. Las direcciones de multidifusión, denominadas *grupos de multidifusión *, son un subconjunto del rango de direcciones IPv4 regular (224.0.0.0 a 230.255.255.255) reservado para el tráfico de multidifusión. Estas direcciones son tratadas especialmente por enrutadores y conmutadores de red, por lo que los mensajes enviados al grupo se pueden distribuir a través de Internet a todos los destinatarios que se han unido al grupo.

source: Some managed switches and routers have multicast traffic disabled by default. If you have trouble with the example programs, check your network hardware settings.
es: Algunos conmutadores y enrutadores administrados tienen deshabilitado por defecto el tráfico de multidifusión. Si tiene problemas con los programas de ejemplo, compruebe la configuración de hardware de red.

source: Sending Multicast Messages
es: Enviando Mensajes de Multidifusión

source: This modified echo client will send a message to a multicast group, then report all of the responses it receives. Since it has no way of knowing how many responses to expect, it uses a timeout value on the socket to avoid blocking indefinitely while waiting for an answer.
es: Este cliente echo modificado enviará un mensaje a un grupo de multidifusión y, a continuación, informará de todas las respuestas que recibe. Como no tiene forma de saber cuántas respuestas esperar, utiliza un valor de tiempo de espera en el socket para evitar el bloqueo indefinido mientras espera una respuesta.

source: The socket also needs to be configured with a *time-to-live* value (TTL) for the messages. The TTL controls how many networks will receive the packet. Set the TTL with the ``IP_MULTICAST_TTL`` option and ``setsockopt()``. The default, ``1``, means that the packets are not forwarded by the router beyond the current network segment. The value can range up to 255, and should be packed into a single byte.
es: El socket también debe configurarse con un valor *time-to-live* (TTL) para los mensajes. El TTL controla cuántas redes recibirán el paquete. Establezca el TTL con la opción ``IP_MULTICAST_TTL`` y ``setsockopt()``. El valor predeterminado, ``1``, significa que los paquetes no son reenviados por el enrutador más allá del segmento de red actual. El valor puede ser de hasta 255, y se debe ser empaquetado en un solo byte.

source: The rest of the sender looks like the UDP echo client, except that it expects multiple responses so uses a loop to call ``recvfrom()`` until it times out.
es: El resto de remitentes se parecen al cliente de echo UDP, excepto que espera múltiples respuestas así que usa un bucle para llamar ``recvfrom()`` hasta que se agota.

source: Receiving Multicast Messages
es: Recibiendo Mensajes de Multidifusión

source: The first step to establishing a multicast receiver is to create the UDP socket. After the regular socket is created and bound to a port, it can be added to the multicast group by using ``setsockopt()`` to change the ``IP_ADD_MEMBERSHIP`` option. The option value is the 8-byte packed representation of the multicast group address followed by the network interface on which the server should listen for the traffic, identified by its IP address. In this case, the receiver listens on all interfaces using ``INADDR_ANY``.
es: El primer paso para establecer un receptor de multidifusión es crear el socket UDP. Después de crear y enlazar el socket normal a un puerto, se puede agregar al grupo de multidifusión usando ``setsockopt()`` para cambiar la opción ``IP_ADD_MEMBERSHIP``. El valor de opción es la representación de 8 bytes de la dirección de grupo de multidifusión seguida por la interfaz de red en la que el servidor debe escuchar el tráfico, identificado por su dirección IP. En este caso, el receptor escucha en todas las interfaces utilizando ``INADDR_ANY``.

source: The main loop for the receiver is just like the regular UDP echo server.
es: El bucle principal para el receptor es igual que el servidor regular de echo UDP.

source: Example Output
es: Ejemplo de Salida

source: This example shows the multicast receiver running on two different hosts. ``A`` has address ``192.168.1.13`` and ``B`` has address ``192.168.1.14``.
es: Este ejemplo muestra el receptor de multidifusión que se ejecuta en dos hosts diferentes. ``A`` tiene la dirección ``192.168.1.13`` y ``B`` tiene la dirección ``192.168.1.14``.

source: The sender is running on host ``B``.
es: El remitente está corriendo en el host ``B``.

source: The message is sent one time, and two acknowledgements of the outgoing message are received, one from each of host ``A`` and ``B``.
es: El mensaje se envía una vez, y se reciben dos reconocimientos del mensaje saliente, uno por cada uno de los hosts ``A`` y ``B``.

source: `Wikipedia: Multicast <https://en.wikipedia.org/wiki/Multicast>`__ -- Article describing technical details of multicasting.
es: `Wikipedia: Multicast <https://en.wikipedia.org/wiki/Multicast>` __ -- Artículo que describe los detalles técnicos de la multidifusión.

source: `Wikipedia: IP Multicast <https://en.wikipedia.org/wiki/IP_multicast>`__ -- Article about IP multicasting, with information about addressing.
es: `Wikipedia: IP Multicast <https://en.wikipedia.org/wiki/IP_multicast>` __ -- Artículo sobre multidifusión IP, con información sobre el direccionamiento.
