Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/socket/udp.po
Languages: es

source: User Datagram Client and Server
es: Cliente y Servidor de Datagrama de Usuario

source: The user datagram protocol (UDP) works differently from TCP/IP. Where TCP is a *stream oriented* protocol, ensuring that all of the data is transmitted in the right order, UDP is a *message oriented* protocol. UDP does not require a long-lived connection, so setting up a UDP socket is a little simpler. On the other hand, UDP messages must fit within a single datagram (for IPv4, that means they can only hold 65,507 bytes because the 65,535 byte packet also includes header information) and delivery is not guaranteed as it is with TCP.
es: El protocolo de datagramas de usuario (UDP) funciona de forma diferente a TCP/IP. Donde TCP es un protocolo *orientado a flujo*, asegurando que todos los datos se transmiten en el orden correcto, UDP es un protocolo *orientado a mensajes*. UDP no requiere una conexión de larga duración, por lo que la configuración de un socket UDP es un poco más simple. Por otro lado, los mensajes UDP deben encajar dentro de un solo datagrama (para IPv4, lo que significa que sólo pueden contener 65.507 bytes porque el paquete de 65.535 bytes también incluye información de encabezado) y la entrega no está garantizada como lo es con TCP.

source: Echo Server
es: Servidor Echo

source: Since there is no connection, per se, the server does not need to listen for and accept connections. It only needs to use ``bind()`` to associate its socket with a port, and then wait for individual messages.
es: Dado que no hay conexión, per se, el servidor no necesita escuchar y aceptar conexiones. Sólo necesita usar ``bind()`` para asociar su socket con un puerto, y luego esperar por los mensajes individuales.

source: Messages are read from the socket using ``recvfrom()``, which returns the data as well as the address of the client from which it was sent.
es: Los mensajes se leen desde el socket usando ``recvfrom()``, que devuelve los datos, así como la dirección del cliente desde el cual se envió.

source: Echo Client
es: Cliente Echo

source: The UDP echo client is similar the server, but does not use ``bind()`` to attach its socket to an address. It uses ``sendto()`` to deliver its message directly to the server, and ``recvfrom()`` to receive the response.
es: El cliente de echo UDP es similar al servidor, pero no utiliza ``bind()`` para conectar su socket a una dirección. Utiliza ``sendto()`` para enviar su mensaje directamente al servidor, y ``recvfrom()`` para recibir la respuesta.

source: Client and Server Together
es: Cliente y Servidor Juntos

source: Running the server produces:
es: Corriendo el servidor produce:

source: The client output is:
es: La salida del cliente es:
