Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/socket/uds.po
Languages: es

source: From the programmer's perspective there are two essential differences between using a Unix domain socket and an TCP/IP socket. First, the address of the socket is a path on the file system, rather than a tuple containing the server name and port. Second, the node created in the file system to represent the socket persists after the socket is closed, and needs to be removed each time the server starts up. The echo server example from earlier can be updated to use UDS by making a few changes in the setup section.
es: Desde la perspectiva del programador hay dos diferencias esenciales entre el uso de un socket de dominio Unix y un socket TCP/IP. En primer lugar, la dirección del socket es una ruta de acceso en el sistema de archivos, en lugar de una tupla que contiene el nombre del servidor y el puerto. En segundo lugar, el nodo creado en el sistema de archivos para representar el socket persiste después de cerrar el socket y debe quitarse cada vez que se inicia el servidor. El ejemplo anterior de servidor de echo puede actualizarse para usar UDS realizando algunos cambios en la sección de configuración.

source: The ``socket`` needs to be created with address family ``AF_UNIX``. Binding the socket and managing the incoming connections works the same as with TCP/IP sockets.
es: El ``socket`` necesita ser creado con la familia de direcciones ``AF_UNIX``. Vincular el socket y administrar las conexiones entrantes funciona igual que con los sockets TCP/IP.

source: The client setup also needs to be modified to work with UDS. It should assume the file system node for the socket exists, since the server creates it by binding to the address. Sending and receiving data works the same way in the UDS client as the TCP/IP client from before.
es: También es necesario modificar la configuración del cliente para que funcione con UDS. Debe suponer que el nodo del sistema de archivos para el socket existe, ya que el servidor lo crea vinculando a la dirección. El envío y la recepción de datos funcionan de la misma manera en el cliente UDS que el cliente TCP/IP de antes.

source: The program output is mostly the same, with appropriate updates for the address information. The server shows the messages received and sent back to the client.
es: La salida del programa es mayormente la misma, con actualizaciones apropiadas para la información de la dirección. El servidor muestra los mensajes recibidos y devueltos al cliente.

source: The client sends the message all at once, and receives parts of it back incrementally.
es: El cliente envía el mensaje de una vez y recibe partes de él de forma incremental.

source: Permissions
es: Permisos

source: Since the UDS socket is represented by a node on the file system, standard file system permissions can be used to control access to the server.
es: Dado que el socket UDS está representado por un nodo en el sistema de archivos, se pueden utilizar permisos del sistema de archivos estándar para controlar el acceso al servidor.

source: Running the client as a user other than ``root`` now results in an error because the process does not have permission to open the socket.
es: Ejecutar el cliente como un usuario distinto de ``root`` ahora produce un error porque el proceso no tiene permiso para abrir el socket.

source: Communication Between Parent and Child Processes
es: Comunicaciones Entre Procesos Padres e Hijos.

source: The ``socketpair()`` function is useful for setting up UDS sockets for inter-process communication under Unix. It creates a pair of connected sockets that can be used to communicate between a parent process and a child process after the child is forked.
es: La función ``socketpair()`` es útil en la configuración de sockets UDS para la comunicación entre procesos bajo Unix. Crea un par de sockets conectados que se pueden utilizar para comunicarse entre un proceso padre y un proceso hijo después de que el hijo es bifurcado.

source: By default, a UDS socket is created, but the caller can also pass address family, socket type, and even protocol options to control how the sockets are created.
es: De forma predeterminada, se crea un socket UDS, pero el llamante también puede pasar la familia de direcciones, el tipo de socket, y las opciones de protocolo incluso para controlar cómo se crean los sockets.
