Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/unittest/index.po
Languages: es_ar

source: unittest -- Automated testing framework
es_ar: unittest -- Framework de automatizado de pruebas

source: Automated testing framework
es_ar: Framework de automatizado de pruebas

source: Python's :mod:`unittest` module, sometimes referred to as PyUnit, is based on the XUnit framework design by Kent Beck and Erich Gamma. The same pattern is repeated in many other languages, including C, perl, Java, and Smalltalk. The framework implemented by :mod:`unittest` supports fixtures, test suites, and a test runner to enable automated testing for your code.
es_ar: El modulo :mod:'unittest' de Python, a veces referido como PyUnit, esta basado en el framework Xunit diseñado por Kent Beck y Erich Gamma. El mismo patron es repetido en varios otros lenguajes, incluyendo C, perl, Java y Samalltalk. El framework implementado por mod:'unittest' soporta fixtures, suites de testeo, y corredor de pruebas para permitir pruebas automatizadas para su código.-

source: Basic Test Structure
es_ar: Estructura de una prueba básica

source: Tests, as defined by ``unittest``, have two parts: code to manage test dependencies (called *fixtures*), and the test itself. Individual tests are created by subclassing ``TestCase`` and overriding or adding appropriate methods. In the following example, the ``SimplisticTest`` has a single ``test()`` method, which would fail if ``a`` is ever different from ``b``.
es_ar: Pruebas, como esta defindo por :mod:'unittest', tiene dos partes: código para gestionar los "fixtures" de prueba, y la prueba en si. Pruebas individuales son creados por subclases TestCase y anulando o añadiendo métodos apropiados. Por ejemplo,

source: unittest_simple.py
es_ar: En este caso, el SimplisticTest tiene un solo método test(), el cual sería un error si Verdadero es siempre Falso.

source: Running Tests
es_ar: Ejecutando pruebas

source: The easiest way to run unittest tests is to include:
es_ar: La forma mas fácil de ejecutar las pruebas de unittest es incluir:

source: The easiest way to run unittest tests is use the automatic discovery available through the command line interface.
es_ar: al final de cada archivo de prueba, entonces simplemente ejecuta el script directamente desde la linea de comandos:

source: This abbreviated output includes the amount of time the tests took, along with a status indicator for each test (the "." on the first line of output means that a test passed). For more detailed test results, include the -v option:
es_ar: Esta salida abreviada incluye la cantidad de tiempo que las pruebas llevaron, junto con un indicador de estado para cada prueba (el "." En la primera línea de salida significa que una prueba superada). Para los resultados de pruebas más detalladas, incluya la opción -v:

source: Test Outcomes
es_ar: Resultados de pruebas

source: Tests have 3 possible outcomes:
es_ar: Las pruebas tienen 3 posibles resultados:

source: The test passes.
es_ar: Las pruebas han sido superadas.

source: The test does not pass, and raises an AssertionError exception.
es_ar: La prueba no ha sido superada, y tira una excepción AssertionError.

source: The test raises an exception other than AssertionError.
es_ar: La prueba genera una excepción distinta de AssertionError.

source: There is no explicit way to cause a test to "pass", so a test's status depends on the presence (or absence) of an exception.
es_ar: No hay manera explícita de causar una prueba para "pass", por lo que el estado de una prueba depende de la presencia (o ausencia) de una excepción.

source: In the previous example, ``testFail()`` fails and the traceback shows the line with the failure code. It is up to the person reading the test output to look at the code to figure out the meaning of the failed test, though.
es_ar: Cuando una prueba falla o genera un error, el rastreo es incluido en la salida.

source: In the example above, :func:`testFail()` fails and the traceback shows the line with the failure code. It is up to the person reading the test output to look at the code to figure out the semantic meaning of the failed test, though. To make it easier to understand the nature of a test failure, the :func:`fail*()` and :func:`assert*()` methods all accept an argument *msg*, which can be used to produce a more detailed error message.
es_ar: En el ejemplo anterior, :func:'testFail()' falla y el rastreo muestra la linea con el código que genera la falla. Corresponde a la persona que lee la salida de prueba a mirar el código y averiguar el significado semántico de la prueba fallida, aunque para que sea mas fácil de entender la naturaleza de la falla de la prueba, todos los métodos func:'fail*()' y func:'assert*()' aceptan un argumento *msg*, que puede ser usado para producir un mensaje de error mas detallado.-

source: Asserting Truth
es_ar: Afirmando Verdad

source: Most tests assert the truth of some condition. There are a few different ways to write truth-checking tests, depending on the perspective of the test author and the desired outcome of the code being tested. If the code produces a value which can be evaluated as true, the methods :func:`failUnless()` and :func:`assertTrue()` should be used. If the code produces a false value, the methods :func:`failIf()` and :func:`assertFalse()` make more sense.
es_ar: La mayoría de las pruebas afirman la verdad de alguna condición. Hay diferentes maneras de escribir pruebas de chequeo de verdad, dependiendo de la perspectiva del autor de las pruebas y de la salida deseada del código que esta siendo testeado. Si el código produce un valor que puede ser evaluado como verdadero, los metodos :func:'failUnless()' y func:'assertTrue()' debieran ser usados. Si el código produce un valor falso, los métodos :func:'failIf()' y :func:'assertFalse()' tienen mas sentido.

source: Testing Equality
es_ar: Comprobación de igualdad

source: As a special case, :mod:`unittest` includes methods for testing the equality of two values.
es_ar: Como un caso especial, :mod:'unittest' incluye métodos para comprobar la igualdad de dos valores

source: These special tests are handy, since the values being compared appear in the failure message when a test fails.
es_ar: Estas pruebas especiales son muy útiles, ya que los valores comparados aparecen en el mensaje de error cuando una prueba falla.

source: And when these tests are run:
es_ar: Y cuando se ejecutan estas pruebas:

source: Almost Equal?
es_ar: Casi igual?

source: In addition to strict equality, it is possible to test for near equality of floating point numbers using :func:`failIfAlmostEqual()` and :func:`failUnlessAlmostEqual()`.
es_ar: Además de estricta igualdad, es posible usar pruebas de aproximamiento para números de punto flotante usando :func:'failIfAlmostEqual()' y :func:'failUnlessAlmostEqual()'

source: The arguments are the values to be compared, and the number of decimal places to use for the test.
es_ar: Los argumentos son los valores a ser comparados, y el numero de lugares decimales a usar para la prueba.

source: Testing for Exceptions
es_ar: Pruebas para excepciones

source: As previously mentioned, if a test raises an exception other than :ref:`AssertionError <exceptions-AssertionError>` it is treated as an error. This is very useful for uncovering mistakes while you are modifying code which has existing test coverage. There are circumstances, however, in which you want the test to verify that some code does produce an exception. For example, if an invalid value is given to an attribute of an object. In such cases, :func:`failUnlessRaises()` makes the code more clear than trapping the exception yourself. Compare these two tests:
es_ar: Como se menciono antes, si una prueba lanza una excepción distinta de :ref:'AssertionError <exceptions-AssertionError>' se trata como un error. Esto es muy útil para para descubrir errores mientras se esta modificando código que ya cuenta con coberturas de pruebas. Hay circunstancias, sin embargo, en la cual se desea que la prueba para verificar algún código no produzca una excepción.

source: The results for both are the same, but the second test using :func:`failUnlessRaises()` is more succinct.
es_ar: El resultado de ambas son iguales, pero la segunda prueba usando :func:'failUnlessRaises()' es mas sucinta.

source: Test Fixtures
es_ar: Pruebas accesorias

source: Fixtures are resources needed by a test. For example, if you are writing several tests for the same class, those tests all need an instance of that class to use for testing. Other test fixtures include database connections and temporary files (many people would argue that using external resources makes such tests not "unit" tests, but they are still tests and still useful). :class:`TestCase` includes a special hook to configure and clean up any fixtures needed by your tests. To configure the fixtures, override :func:`setUp()`. To clean up, override :func:`tearDown()`.
es_ar: Accesorios son recursos necesitados por el test. Por ejemplo, si estas escribiendo varias pruebas para la misma clase, todas necesitan una instancia de la clase usada por la prueba. Otras pruebas accesorias incluyen conexión a base de datos y archivos temporales (muchas personas podrían argumentar que el uso de recursos externos hace que tales pruebas no sean "unit"test, pero no dejan de ser pruebas y siendo útiles). :class:'TestCase' incluyen un gancho especial para configurar y limpiar los accesorios necesarios para las pruebas. Para limpiar, sobrescriba :func:'tearDown()'

source: ``unittest`` includes special hooks to configure and clean up any fixtures needed by tests. To establish fixtures for each individual test case, override ``setUp()`` on the ``TestCase``. To clean them up, override ``tearDown()``. To manage one set of fixtures for all instances of a test class, override the class methods ``setUpClass()`` and ``tearDownClass()`` for the ``TestCase``. And to handle especially expensive setup operations for all of the tests within a module, use the module-level functions ``setUpModule()`` and ``tearDownModule()``.
es_ar: Cuando se ejecuta la prueba de muestra, se puede ver el orden de ejecución de los accesorios y los métodos de la prueba

source: Test Suites
es_ar: Conjunto de pruebas

source: The standard library documentation describes how to organize test suites manually. I generally do not use test suites directly, because I prefer to build the suites automatically (these are automated tests, after all). Automating the construction of test suites is especially useful for large code bases, in which related tests are not all in the same place. Tools such as nose make it easier to manage tests when they are spread over multiple files and directories.
es_ar: La documentación de la biblioteca estándar describe cómo organizar conjuntos de pruebas manualmente. Yo generalmente no uso los conjuntos de pruebas directamente, porque prefiero construir conjuntos de pruebas de forma automática (estas son pruebas automatizadas, después de todo). La automatización de la construcción de los conjuntos de pruebas es especialmente útil para bases de código grandes, en el que las pruebas relacionadas no están todas en el mismo lugar. Herramientas como la "nariz" hace que sea mas fácil de manejar las pruebas cuando están repartidas en varios archivos y directorios.

source: Standard library documentation for this module.
es_ar: Documentación de la biblioteca estándar para este módulo

source: It is frequently useful to run the same test logic with different inputs. Rather than defining a separate test method for each small case, a common way of doing this is to use one test method containing several related assertion calls. The problem with this approach is that as soon as one assertion fails, the rest are skipped. A better solution is to use ``subTest()`` to create a context for a test within a test method. If the test fails, the failure is reported and the remaining tests continue.
es_ar: Un medio alternativo para la realización de pruebas incorporados en docstrings o archivos de documentación externos.

source: A more sophisticated test manager.
es_ar: Un manejador de pruebas mas sofisticado

source: Ongoing improvements to :mod:`unittest`
es_ar: Mejoras en curso para :mod:'unittest'
