Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/anydbm/index.po
Languages: es_ar

source: anydbm -- Access to DBM-style databases
es_ar: anydbm -- Acceso a las bases de datos de estilo DBM

source: anydbm provides a generic dictionary-like interface to DBM-style, string-keyed databases
es_ar: anydbm ofrece una interfaz genérica similar a un diccionario de estilo DBM, base de datos clave-cadena

source: 1.4 and later
es_ar: 1.4 o posterior

source: anydbm is a front-end for DBM-style databases that use simple string values as keys to access records containing strings. It uses the :mod:`whichdb` module to identify :mod:`dbhash`, :mod:`gdbm`, and :mod:`dbm` databases, then opens them with the appropriate module. It is used as a backend for :mod:`shelve`, which knows how to store objects using :mod:`pickle`.
es_ar: anydbm es un front-end para las bases de datos al estilo de DBM que utilizan valores de cadenas simples como claves para acceder a los registros que contienen cadenas. Utiliza el módulo :mod:`whichdb` para identificar :mod:` dbhash`, :mod:`gdbm` y base de datos :mod:`dbm`, luego los abre con el módulo correspondiente. Se utiliza como un backend para :mod:`shelve`, que sabe cómo almacenar objetos usando :mod:`pickle`.

source: Creating a New Database
es_ar: Creando una base de datos

source: The storage format for new databases is selected by looking for each of these modules in order:
es_ar: El formato de almacenamiento para nuevas bases de datos se selecciona mediante la búsqueda de cada uno de estos módulos con el fin de:

source: The :func:`open` function takes *flags* to control how the database file is managed. To create a new database when necessary, use ``'c'``. To always create a new database, use ``'n'``.
es_ar: La función :func:`open` toma *banderas* para controlar como se gestiona el archivo de base de datos. Para crear una nueva base de datos cuando sea necesario, use ``'c'``. Para crear siempre una nueva base de datos, use ``'n'``.

source: In this example, the file is always re-initialized. To see what type of database was created, we can use :mod:`whichdb`.
es_ar: En este ejemplo, siempre se re-inicializa el archivo. Para ver qué tipo de base de datos fue creada, podemos utilizar :mod:`whichdb`.

source: Your results may vary, depending on what modules are installed on your system.
es_ar: Sus resultados pueden variar, dependiendo de lo que los módulos están instalados en su sistema.

source: Opening an Existing Database
es_ar: Abrir una base de datos existente

source: To open an existing database, use *flags* of either ``'r'`` (for read-only) or ``'w'`` (for read-write). You don't need to worry about the format, because existing databases are automatically given to :mod:`whichdb` to identify. If a file can be identified, the appropriate module is used to open it.
es_ar: Para abrir una base de datos existente, utilice cualquiera de estas *banderas* '''r'`` (para sólo lectura) o ``'w'`` (para lectura-escritura). Usted no necesita preocuparse por el formato, ya que las bases de datos existentes le dan automáticamente a :mod:`whichdb` la forma de identificar. Si un archivo puede ser identificado, el módulo adecuado se utiliza para abrirlo.

source: Once open, ``db`` is a dictionary-like object, with support for the usual methods:
es_ar: Una vez abierta, ``db`` es un objeto similar a un diccionario, con soporte para los métodos habituales:

source: Error Cases
es_ar: Los casos de error

source: The keys of the database need to be strings.
es_ar: Las claves de la base de datos deben ser cadenas.

source: Passing another type results in a :ref:`TypeError <exceptions-TypeError>`.
es_ar: Pasar a otro tipo de resultados en un :ref: `TypeError <exceptions-TypeError>`.

source: Values must be strings or ``None``.
es_ar: Los valores deben ser cadenas o `` None``.

source: A similar :ref:`TypeError <exceptions-TypeError>` is raised if a value is not a string.
es_ar: Un error :ref:`TypeError <expetioins-TypeError>` se eleva si un valor no es una cadena.

source: Module :mod:`shelve`
es_ar: Modulo :mod:`shelve`

source: Examples for the :mod:`shelve` module, which uses :mod:`anydbm` to store data.
es_ar: Ejemplos para el :mod:`módulo shelve`, que utiliza :mod:`anydbm` para almacenar datos.

source: The standard library documentation for this module.
es_ar: La documentación de la biblioteca estándar para este módulo.

source: Descriptions of other modules for storing data.
es_ar: Descripciones de otros módulos para el almacenamiento de datos.
