Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/abc/index.po
Languages: es_ar

source: abc -- Abstract Base Classes
es_ar: abc - Clases base abstractas

source: Define and use abstract base classes for API checks in your code.
es_ar: Definir y utilizar clases base abstractas para los controles de la API en su código.

source: Why use Abstract Base Classes?
es_ar: ¿Por qué utilizar clases base abstractas?

source: Abstract base classes are a form of interface checking more strict than individual ``hasattr()`` checks for particular methods. By defining an abstract base class, you can define a common API for a set of subclasses. This capability is especially useful in situations where a third-party is going to provide implementations, such as with plugins to an application, but can also aid you when working on a large team or with a large code-base where keeping all classes in your head at the same time is difficult or not possible.
es_ar: Clases base abstractas son una forma de interfaz de comprobación mas estricta que controles individuales ``hasattr()`` para métodos particulares

source: How ABCs Work
es_ar: Como trabaja ABC

source: :mod:`abc` works by marking methods of the base class as abstract, and then registering concrete classes as implementations of the abstract base. If your code requires a particular API, you can use ``issubclass()`` or ``isinstance()`` to check an object against the abstract class.
es_ar: :mod:'abc' trabaja marcando métodos de la clase base como abstracto, y luego registrando clases concretas como implementaciones de la base abstracta. Si su código requiere una API particular, puedes usar ''issubclass()'' o ''isinstance()'' para comprobar un objeto contra la clase abstracta

source: Let's start by defining an abstract base class to represent the API of a set of plugins for saving and loading data.
es_ar: Vamos a empezar a definiendo una clase base abstracta para representar la API de un conjunto de plugins para guardar y cargar datos

source: Registering a Concrete Class
es_ar: Registrando una clase concreta

source: There are two ways to indicate that a concrete class implements an abstract: register the class with the abc or subclass directly from the abc.
es_ar: Hay dos formas para indicar una que una clase concreta implementa un abstracto: registrar la clase con abc o subclase directamente desde abc

source: In this example the ``PluginImplementation`` is not derived from ``PluginBase``, but is registered as implementing the ``PluginBase`` API.
es_ar: En este de ejemplo de ``PluginImplementation`` no deriva de ``PluginBase``, pero esta registrado como una implementación de la API ``PluginBase``

source: Implementation Through Subclassing
es_ar: Implementación a través de subclases

source: By subclassing directly from the base, we can avoid the need to register the class explicitly.
es_ar: Por clases directamente de la base, se puede evitar la necesidad de registrar la clase explícitamente.

source: In this case the normal Python class management is used to recognize ``PluginImplementation`` as implementing the abstract ``PluginBase``.
es_ar: En este caso se usa la gestión normal de la clase de Python para reconocer ``PluginImplementation`` como una implementación abstracta de ``PluginBase``.

source: A side-effect of using direct subclassing is it is possible to find all of the implementations of your plugin by asking the base class for the list of known classes derived from it (this is not an abc feature, all classes can do this).
es_ar: Un efecto secundario del uso de subclases directa es que es posible encontrar todas las implementaciones de su plugin consultando a la clase base por la lista de las clases conocidas derivadas de ella (esto no es una característica de abc, todas las clases pueden hacer esto)

source: Notice that even though ``abc_register`` is imported, ``RegisteredImplementation`` is not among the list of subclasses because it is not actually derived from the base.
es_ar: Tenga en cuenta que a pesar de que `` abc_register`` es importado, `` RegisteredImplementation`` no está en la lista de subclases, ya que en realidad no deriva de la base.

source: Dr. André Roberge `has described <http://us.pycon.org/2009/conference/schedule/event/47/>`_ using this capability to discover plugins by importing all of the modules in a directory dynamically and then looking at the subclass list to find the implementation classes.
es_ar: Dr. André Roberge `ha descrito <http://us.pycon.org/2009/conference/schedule/event/47/>` _ utilización de esta capacidad para descubrir plugins mediante la importación de todos los módulos en un directorio de forma dinámica y luego mirando en la lista de subclase para encontrar las implementaciones de las clases.

source: Incomplete Implementations
es_ar: Implementaciones imcompletas

source: Another benefit of subclassing directly from your abstract base class is that the subclass cannot be instantiated unless it fully implements the abstract portion of the API. This can keep half-baked implementations from triggering unexpected errors at runtime.
es_ar: Otro beneficio de subclases directamente desde su clase base abstracta es que la subclase no puede ser instanciada a menos que aplique plenamente la parte abstracta de la API. Esto puede mantener implementaciones medio terminadas activen errores inesperados en tiempo de ejecución.

source: Concrete Methods in ABCs
es_ar: Métodos concretos en ABC

source: Although a concrete class must provide an implementation of an abstract methods, the abstract base class can also provide an implementation that can be invoked via ``super()``. This lets you re-use common logic by placing it in the base class, but force subclasses to provide an overriding method with (potentially) custom logic.
es_ar: Aunque una clase concreta debe proporcionar una implementación de un método abstracto, la clase base abstracta también puede proporcionar una implementación que se puede invocar a través de `` super () ``. Esto le permite volver a utilizar la lógica común mediante la colocación en la clase base, pero fuerza a la subclase a proporcionar un método primordial con (potencialmente) lógica personalizada.

source: Since ``ABCWithConcreteImplementation`` is an abstract base class, it isn't possible to instantiate it to use it directly. Subclasses *must* provide an override for ``retrieve_values()``, and in this case the concrete class massages the data before returning it at all.
es_ar: Desde `` ABCWithConcreteImplementation`` es una clase base abstracta, no es posible crear una instancia para utilizarlo directamente. Las subclases *deben* proporcionar un reemplazo para `` retrieve_values () ``, y en este caso las clases concretas transforman los datos antes de devolverlos a todos.

source: Abstract Properties
es_ar: Propiedades abstractas

source: If your API specification includes attributes in addition to methods, you can require the attributes in concrete classes by defining them with ``@abstractproperty``.
es_ar: Si su especificación API incluye atributos además de los métodos, se puede requerir los atributos en una clase concreta definiendo estos con ``@abstractproperty``.

source: The ``Base`` class in the example cannot be instantiated because it has only an abstract version of the property getter method.
es_ar: La clase ``Base`` en el ejemplo no puede ser instanciada porque tiene solamente una versión abstracta del método getter de la propiedad.

source: You can also define abstract read/write properties.
es_ar: También puede definir las propiedades abstractas de lectura / escritura.

source: Notice that the concrete property must be defined the same way as the abstract property. Trying to override a read/write property in ``PartialImplementation`` with one that is read-only does not work.
es_ar: Observe que la propiedad en concreto debe ser definida de la misma manera como la propiedad abstracta. Tratar de sobrescribir una propiedad de lectura / escritura en ``PartialImplementation`` con uno que es de sólo lectura no funciona.

source: To use the decorator syntax does with read/write abstract properties, the methods to get and set the value should be named the same.
es_ar: Para utilizar la sintaxis de decorador con las propiedades abstractas de lectura/escritura, los métodos para obtener y establecer el valor deben tener el mismo nombre.

source: Notice that both methods in the ``Base`` and ``Implementation`` classes are named ``value()``, although they have different signatures.
es_ar: Observe que ambos métodos en las clases ``Base`` y ``Implementation`` se llaman ``value()``, aunque tienen diferentes firmas.

source: Collection Types
es_ar: Tipos de colección

source: The :mod:`collections` module defines several abstract base classes related to container (and containable) types.
es_ar: El módulo :mod:`collections` define varios tipos de clases abstractas relacionadas con contenedores (y controlable).

source: General container classes:
es_ar: Contenedor general de clases:

source: Iterator and Sequence classes:
es_ar: Clases Iterator y Sequence

source: Unique values:
es_ar: Valores únicos:

source: Mappings:
es_ar: Asignaciones:

source: Miscelaneous:
es_ar: Misceláneos

source: In addition to serving as detailed real-world examples of abstract base classes, Python's built-in types are automatically registered to these classes when you import :mod:`collections`. This means you can safely use ``isinstance()`` to check parameters in your code to ensure that they support the API you need. The base classes can also be used to define your own collection types, since many of them provide concrete implementations of the internals and only need a few methods overridden. Refer to the standard library docs for collections for more details.
es_ar: Además de servir como ejemplos detallados de clases base abstractas del mundo real, los tipos integrados de Python están registrados automáticamente a estas clases al importar :mod:`collections`. Esto significa que usted puede utilizar con seguridad ``isinstance()`` para comprobar parámetros en su código para asegurarse de que apoyan la API que necesita. Las clases base también se pueden usar para definir sus propios tipos de colección, ya que muchos de ellos ofrecen implementaciones concretas de las partes internas y sólo necesitan sobrescribir algunos métodos. Consulte la documentación de la biblioteca estándar de colecciones para más detalles.

source: The standard library documentation for this module.
es_ar: La documentación de la biblioteca estándar para este módulo.

source: Introducing Abstract Base Classes
es_ar: La introducción de clases base abstractas

source: The collections module includes abstract base classes for several collection types.
es_ar: El módulo de colecciones incluye clases base abstractas para varios tipos de colección.

source: The standard library documentation for collections.
es_ar: La documentación de la biblioteca estándar para colecciones.

source: A Type Hierarchy for Numbers
es_ar: Una jerarquía de tipos de números

source: Description and examples of the strategy pattern.
es_ar: Descripción y ejemplos del patrón de estrategia.

source: PyCon 2009 presentation by Dr. André Roberge
es_ar: Presentación en la PyCon 2009 por el Dr. André Roberge
