Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/doctest/index.po
Languages: es_419

source: When both :mod:`unittest` and ``doctest`` are used for testing the same code in different situations, the ``unittest`` integration in ``doctest`` can be used to run the tests together. Two classes, ``DocTestSuite`` and ``DocFileSuite`` create test suites compatible with the test-runner API of ``unittest``.
es_419: Cuando se usan: mod: `unittest` y ``doctest`` para probar el mismo código en diferentes situaciones, se puede usar la integración ``unittest`` en ``doctest`` para ejecutar las pruebas juntas. Dos clases, ``DocTestSuite`` y `` DocFileSuite`` crean suites de prueba compatibles con el API test-runner de ``unittest``.

source: The tests from each source are collapsed into a single outcome, instead of being reported individually.
es_419: Las pruebas de cada fuente se colapsan en un único resultado, en lugar de ser informado individualmente.

source: Test Context
es_419: Contexto de Prueba

source: The execution context created by ``doctest`` as it runs tests contains a copy of the module-level globals for the test module. Each test source (function, class, module) has its own set of global values to isolate the tests from each other somewhat, so they are less likely to interfere with one another.
es_419: El contexto de ejecución creado por ``doctest`` al ejecutar pruebas contiene una copia de los globales a nivel de módulo para el módulo de prueba. Cada fuente de prueba (función, clase, módulo) tiene su propio conjunto de valores globales para aislar los ensayos unos de otros, por lo que es menos probable que interfieran entre sí.

source: ``TestGlobals`` has two methods: ``one()`` and ``two()``. The tests in the docstring for ``one()`` set a global variable, and the test for ``two()`` looks for it (expecting not to find it).
es_419: ``TestGlobals`` tiene dos métodos: ``one ()`` y ``two ()``. Las pruebas de la docstring para ``one ()`` establecen una variable global, y la prueba de ``two ()`` busca por ella (esperando no encontrarla).

source: That does not mean the tests *cannot* interfere with each other, though, if they change the contents of mutable variables defined in the module.
es_419: Eso no significa que las pruebas *no pueden* interferir entre sí, aunque, ellas cambien el contenido de las variables mutables definidas en el módulo.

source: The module variable ``_module_data`` is changed by the tests for ``one()``, causing the test for ``two()`` to fail.
es_419: La variable de módulo ``_module_data`` es cambiada por las pruebas de ``one ()``, haciendo que la prueba de ``two ()`` falle.

source: If global values are needed for the tests, to parameterize them for an environment for example, values can be passed to ``testmod()`` and ``testfile()`` to have the context set up using data controlled by the caller.
es_419: Si se necesitan valores globales para las pruebas, para parametrizarlos para un entorno, por ejemplo, los valores se pueden pasar a ``testmod ()`` y ``testfile ()`` para que el contexto se configure utilizando datos controlados por el llamador.

source: `The Mighty Dictionary <https://www.youtube.com/watch?v=C4Kc8xzcA68>`__ -- Presentation by Brandon Rhodes at PyCon 2010 about the internal operations of the ``dict``.
es_419: `The Mighty Dictionary <https://www.youtube.com/watch?v=C4Kc8xzcA68>` __ - Presentación de Brandon Rhodes en PyCon 2010 sobre las operaciones internas del ``dict``.

source: :mod:`difflib` -- Python's sequence difference computation library, used to produce the ndiff output.
es_419: :mod: `difflib` -- Biblioteca python de computación de diferencias de secuencias, utilizada para producir la salida ndiff.

source: `Sphinx <http://www.sphinx-doc.org/>`_ -- As well as being the documentation processing tool for Python's standard library, Sphinx has been adopted by many third-party projects because it is easy to use and produces clean output in several digital and print formats. Sphinx includes an extension for running doctests as is processes documentation source files, so the examples are always accurate.
es_419: `Sphinx <http://www.sphinx-doc.org/>`_ -- Además de ser la herramienta de procesamiento de documentación para la biblioteca estándar de Python, Sphinx ha sido adoptada por muchos proyectos de terceros porque es fácil de usar y produce salida limpia en varios formatos digitales e impresos. Sphinx incluye una extensión para ejecutar doctests así como los archivos fuentes de documentación de procesos, por lo que los ejemplos son siempre precisos.

source: `py.test <http://doc.pytest.org/en/latest/>`_ -- Third-party test runner with ``doctest`` support.
es_419: `py.test <http://doc.pytest.org/en/latest/>`_-- Runner de prueba de terceros con soporte ``doctest``.

source: `nose2 <https://nose2.readthedocs.io/en/latest/>`_ -- Third-party test runner with ``doctest`` support.
es_419: `nose2 <https://nose2.readthedocs.io/es/latest/>`_-- Runner de prueba de terceros con soporte ``doctest``.

source: `Manuel <https://pythonhosted.org/manuel/>`_ -- Third-party documentation-based test runner with more advanced test case extraction and integration with Sphinx.
es_419: `Manuel <https://pythonhosted.org/manuel/>`_-- Runner de prueba basado en documentación de terceros con una extracción de casos de prueba más avanzada e integración con Sphinx.
