Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/doctest/index.po
Languages: es_419

source: doctest --- Testing Through Documentation
es_419: doctest --- Pruebas a través de la Documentación

source: Write automated tests as part of the documentation for a module.
es_419: Escribir pruebas automatizadas como parte de la documentación de un módulo.

source: ``doctest`` tests source code by running examples embedded in the documentation and verifying that they produce the expected results. It works by parsing the help text to find examples, running them, then comparing the output text against the expected value. Many developers find ``doctest`` easier to use than :mod:`unittest` because, in its simplest form, there is no API to learn before using it. However, as the examples become more complex the lack of fixture management can make writing ``doctest`` tests more cumbersome than using :mod:`unittest`.
es_419: ``doctest`` prueba el código fuente ejecutando ejemplos incluidos en la documentación y verificando que producen los resultados esperados. Funciona analizando el texto de ayuda para encontrar ejemplos, ejecutándolos, luego comparando el texto de salida con el valor esperado. Muchos desarrolladores encuentran que ``doctest`` es más fácil de usar que: mod: `unittest` porque, en su forma más simple, no hay API que aprender antes de usarla. Sin embargo, a medida que los ejemplos se vuelven más complejos, la falta de gestión de los accesorios puede hacer que las pruebas de escritura ``doctest`` sean más engorrosas que usar: mod: `unittest`.

source: Getting Started
es_419: Empezando.

source: The first step to setting up doctests is to use the interactive interpreter to create examples and then copy and paste them into the docstrings in the module. Here, ``my_function()`` has two examples given:
es_419: El primer paso para configurar doctests es usar el intérprete interactivo para crear ejemplos y luego copiarlos y pegarlos en las docstrings del módulo. Aquí, ``my_function ()`` tiene dos ejemplos dados:

source: To run the tests, use ``doctest`` as the main program via the ``-m`` option. Usually no output is produced while the tests are running, so the next example includes the ``-v`` option to make the output more verbose.
es_419: Para ejecutar las pruebas, use ``doctest`` como programa principal con la opción ``-m``. Por lo general, no se produce ninguna salida mientras se ejecutan las pruebas, por lo que el siguiente ejemplo incluye la opción ``-v`` para hacer la salida más detallada.

source: Examples cannot usually stand on their own as explanations of a function, so ``doctest`` also allows for surrounding text. It looks for lines beginning with the interpreter prompt (``>>>``) to find the beginning of a test case, and the case is ended by a blank line or by the next interpreter prompt. Intervening text is ignored, and can have any format as long as it does not look like a test case.
es_419: Por lo general, los ejemplos no pueden mantenerse por sí solos como explicaciones de una función, de modo que ``doctest`` también permite el texto circundante. Busca líneas que comiencen con el prompt de intérprete (``>>>``) para encontrar el comienzo de un caso de prueba, y el caso termina con una línea en blanco o con el siguiente prompt de intérprete. El texto interviniente se ignora y puede tener cualquier formato, siempre y cuando no parezca un caso de prueba.

source: The surrounding text in the updated docstring makes it more useful to a human reader. Because it is ignored by ``doctest``, the results are the same.
es_419: El texto circundante en la docstring actualizada lo hace más útil para un lector humano. Debido a que es ignorado por ``doctest``, los resultados son los mismos.

source: Handling Unpredictable Output
es_419: Manejo de Salida Impredecible.

source: There are other cases where the exact output may not be predictable, but should still be testable. For example, local date and time values and object ids change on every test run, the default precision used in the representation of floating point values depend on compiler options, and string representations of container objects like dictionaries may not be deterministic. Although these conditions cannot be controlled, there are techniques for dealing with them.
es_419: Hay otros casos en los que la salida exacta puede no ser predecible, pero debe ser aún comprobable. Por ejemplo, los valores de fecha y hora locales y los identificadores de objeto cambian en cada ejecución de prueba, la precisión predeterminada utilizada en la representación de valores de punto flotante depende de las opciones del compilador y las representaciones de cadena de objetos contenedores, como diccionarios, pueden no ser determinísticas. Aunque estas condiciones no pueden ser controladas, existen técnicas para tratarlas.

source: For example, in CPython, object identifiers are based on the memory address of the data structure holding the object.
es_419: Por ejemplo, en CPython, los indentificadores de objetos están basados en la dirección de memoria de la estructura de datos que mantiene el objeto.

source: These id values change each time a program runs, because it is loaded into a different part of memory.
es_419: Estos valores de id cambian cada vez que se ejecuta un programa, porque se carga en una parte diferente de la memoria.

source: When the tests include values that are likely to change in unpredictable ways, and where the actual value is not important to the test results, use the ``ELLIPSIS`` option to tell ``doctest`` to ignore portions of the verification value.
es_419: Cuando las pruebas incluyen valores que es probable que cambien de manera impredecible, y donde el valor real no es importante para los resultados de la prueba, use la opción ``ELLIPSIS`` para decir a ``doctest`` ignorar partes del valor de verificación.

source: The "``#doctest: +ELLIPSIS``" comment after the call to ``unpredictable()`` tells ``doctest`` to turn on the ``ELLIPSIS`` option for that test. The ``...`` replaces the memory address in the object id, so that portion of the expected value is ignored and the actual output matches and the test passes.
es_419: El comentario de ``#doctest: + ELLIPSIS`` después de la llamada ``unpredictable ()`` indica a ``doctest`` activar la opción ``ELLIPSIS`` para esa prueba. El ``...`` reemplaza la dirección de memoria en el identificador de objeto, de modo que se ignora la parte del valor esperado y la salida real coincide y la prueba pasa.

source: There are cases where the unpredictable value cannot be ignored, because that would make the test incomplete or inaccurate. For example, simple tests quickly become more complex when dealing with data types whose string representations are inconsistent. The string form of a dictionary, for example, may change based on the order the keys are added.
es_419: Hay casos en que el valor impredecible no puede ser ignorado, porque eso haría la prueba incompleta o inexacta. Por ejemplo, las pruebas simples rápidamente se vuelven más complejas cuando se trata de tipos de datos cuyas representaciones de cadena son inconsistentes. La forma de cadena de un diccionario, por ejemplo, puede cambiar en función del orden en que se agregan las claves.

source: Because of hash randomization and key collision, the internal key list order may be different for the dictionary each time the script runs. Sets use the same hashing algorithm, and exhibit the same behavior.
es_419: Debido a la aleatorización del hash y la colisión de clave, el orden de lista de claves internas puede ser diferente para el diccionario cada vez que se ejecuta el script. Los conjuntos utilizan el mismo algoritmo hash y muestran el mismo comportamiento.

source: The best way to deal with these potential discrepancies is to create tests that produce values that are not likely to change. In the case of dictionaries and sets, that might mean looking for specific keys individually, generating a sorted list of the contents of the data structure, or comparing against a literal value for equality instead of depending on the string representation.
es_419: La mejor manera de lidiar con estas discrepancias potenciales es crear pruebas que produzcan valores que no sea probable que cambien. En el caso de diccionarios y conjuntos, esto podría significar buscar claves específicas individualmente, generando una lista ordenada del contenido de la estructura de datos, o comparar contra un valor literal por igualdad en lugar de depender de la representación de la cadena.

source: The single example is actually interpreted as two separate tests, with the first expecting no console output and the second expecting the boolean result of the comparison operation.
es_419: El ejemplo único se interpreta realmente como dos pruebas separadas, con la primera no espera salida de consola y la segunda esperando el resultado booleano de la operación de comparación.

source: Tracebacks are a special case of changing data. Since the paths in a traceback depend on the location where a module is installed on the file system, it would be impossible to write portable tests if they were treated the same as other output.
es_419: Las trazas (Tracebacks) son un caso especial de cambio de datos. Dado que las rutas en un rastreo (tracebacks) dependen de la ubicación en la que se instale un módulo en el sistema de archivos, sería imposible escribir pruebas portátiles si estas fueran tratadas de la misma manera que otras salidas.

source: ``doctest`` makes a special effort to recognize tracebacks, and ignore the parts that might change from system to system.
es_419: ``doctest`` hace un esfuerzo especial para reconocer los rastreos (tracebacks), e ignora las partes que pueden cambiar de un sistema a otro.

source: In fact, the entire body of the traceback is ignored and can be omitted.
es_419: De hecho, todo el cuerpo del rastreo (traceback) es ignorado y puede omitirse.

source: When ``doctest`` sees a traceback header line (either "``Traceback (most recent call last):``" or "``Traceback (innermost last):``", to support different versions of Python), it skips ahead to find the exception type and message, ignoring the intervening lines entirely.
es_419: Cuando ``doctest`` ve una línea de encabezado de traceback (ya sea "``Traceback (most recent call last):``" o "``Traceback (innermost last):``", para soportar diferentes versiones de Python), se adelanta para encontrar el tipo de excepción y el mensaje, ignorando completamente las líneas intermedias.

source: In real world applications, output usually includes whitespace such as blank lines, tabs, and extra spacing to make it more readable. Blank lines, in particular, cause issues with ``doctest`` because they are used to delimit tests.
es_419: En las aplicaciones del mundo real, la salida suele incluir espacios en blanco, como líneas en blanco, tabulaciones, espaciado adicional para hacerlo más legible. Las líneas en blanco, en particular, causan problemas con ``doctest`` porque se utilizan para delimitar pruebas.

source: ``double_space()`` takes a list of input lines, and prints them double-spaced with blank lines between.
es_419: ``double_space ()`` toma una lista de líneas de entrada, y las imprime a doble espacio con líneas en blanco en medio.

source: The test fails, because it interprets the blank line after the line containing ``Line one.`` in the docstring as the end of the sample output. To match the blank lines, replace them in the sample input with the string ``<BLANKLINE>``.
es_419: La prueba falla, ya que interpreta la línea en blanco después de la línea que contiene ``Line one.`` en la docstring como el final de la salida de muestra. Para hacer coincidir las líneas en blanco, sustitúyalas en la entrada de muestra con la cadena ``<BLANKLINE>``.

source: ``doctest`` replaces actual blank lines with the same literal before performing the comparison, so now the actual and expected values match and the test passes.
es_419: ``doctest`` reemplaza líneas en blanco reales con el mismo literal antes de realizar la comparación, por lo que ahora los valores reales y esperados coinciden y la prueba pasa.

source: Whitespace within a line can also cause tricky problems with tests. This example has a single extra space after the ``6``.
es_419: Los espacios en blanco dentro de una línea también pueden causar problemas difíciles con las pruebas. Este ejemplo tiene un espacio adicional después del ``6``.

source: Extra spaces can find their way into code via copy-and-paste errors, but since they come at the end of the line, they can go unnoticed in the source file and be invisible in the test failure report as well.
es_419: Los espacios adicionales pueden encontrar su camino en el código a través de copiar y pegar errores, pero ya que vienen al final de la línea, pueden pasar desapercibidos en el archivo fuente y ser invisible en el informe de fallos de prueba también.

source: Using one of the diff-based reporting options, such as ``REPORT_NDIFF``, shows the difference between the actual and expected values with more detail, and the extra space becomes visible.
es_419: El uso de una de las opciones de generación de informes basadas en diferencias, como ``REPORT_NDIFF``, muestra la diferencia entre los valores real y esperado con más detalle, y el espacio adicional se vuelve visible.

source: Unified (``REPORT_UDIFF``) and context (``REPORT_CDIFF``) diffs are also available, for output where those formats are more readable.
es_419: También están disponibles unificados (``REPORT_UDIFF``) y diffs de context (``REPORT_CDIFF``), para la salida donde esos formatos son más legibles.

source: There are cases where it is beneficial to add extra whitespace in the sample output for the test, and have ``doctest`` ignore it. For example, data structures can be easier to read when spread across several lines, even if their representation would fit on a single line.
es_419: Hay casos en los que es beneficioso agregar espacios en blanco extra en la salida de muestra para la prueba, y que ``doctest`` lo ignore. Por ejemplo, las estructuras de datos pueden ser más fáciles de leer cuando se distribuyen a través de varias líneas, incluso si su representación cabría en una sola línea.

source: When ``NORMALIZE_WHITESPACE`` is turned on, any whitespace in the actual and expected values is considered a match. Whitespace cannot be added to the expected value where none exists in the output, but the length of the whitespace sequence and actual whitespace characters do not need to match. The first test example gets this rule correct, and passes, even though there are extra spaces and newlines. The second has extra whitespace after ``[`` and before ``]``, so it fails.
es_419: Cuando ``NORMALIZE_WHITESPACE`` está activado, cualquier espacio en blanco en los valores reales y esperados se considera una coincidencia. Los espacios en blanco no se pueden agregar al valor esperado donde no existe ninguno en la salida, pero la longitud de la secuencia de espacios en blanco y los caracteres de espacio en blanco reales no necesitan coincidir. El primer ejemplo de prueba obtiene esta regla correcta, y pasa, aunque hay espacios adicionales y nuevas líneas. El segundo tiene espacio en blanco extra después de ``[`` y antes de ``]``, por lo que falla.

source: All of the tests in the examples so far have been written in the docstrings of the functions they are testing. That is convenient for users who examine the docstrings for help using the function (especially with :mod:`pydoc`), but ``doctest`` looks for tests in other places, too. The obvious location for additional tests is in the docstrings elsewhere in the module.
es_419: Todas las pruebas en los ejemplos hasta ahora se han escrito en las docstrings de las funciones que están probando. Esto es conveniente para los usuarios que examinan las docstrings para obtener ayuda usando la función (especialmente con: mod: `pydoc`), pero ``doctest`` busca pruebas en otros lugares, también. La ubicación obvia para las pruebas adicionales está en las docstrings en otras partes del módulo.

source: Docstrings at the module, class, and function levels can all contain tests.
es_419: Docstrings en los niveles de módulo, clase y función pueden contener pruebas.

source: There are cases where tests exist for a module that should be included with the source code but not in the help text for a module, so they need to be placed somewhere other than the docstrings. ``doctest`` also looks for a module-level variable called ``__test__`` and uses it to locate other tests. The value of ``__test__`` should be a dictionary that maps test set names (as strings) to strings, modules, classes, or functions.
es_419: Hay casos en los que existen pruebas para un módulo que debe incluirse en el código fuente pero no en el texto de ayuda de un módulo, por lo que deben colocarse en algún lugar distinto de las docstrings. ``Doctest`` también busca una variable de nivel de módulo llamada ``__test__`` y la usa para localizar otras pruebas. El valor de ``__test__`` debería ser un diccionario que mapee nombres de conjuntos de prueba (como cadenas) a cadenas, módulos, clases o funciones.

source: If the value associated with a key is a string, it is treated as a docstring and scanned for tests. If the value is a class or function, ``doctest`` searches them recursively for docstrings, which are then scanned for tests. In this example, the module :mod:`doctest_private_tests_external` has a single test in its docstring.
es_419: Si el valor asociado a una clave es una cadena, se lo trata como una docstring y se lo analiza en busca de pruebas. Si el valor es una clase o función, ``doctest`` las busca de forma recursiva para docstrings, que luego se analizarán en busca de pruebas. En este ejemplo, el módulo: mod: `doctest_private_tests_external` tiene una sola prueba en su docstring.

source: After scanning the example file, ``doctest`` finds a total of five tests to run.
es_419: Después de escanear el archivo de ejemplo, ``doctest`` encuentra un total de cinco pruebas para ejecutar.

source: External Documentation
es_419: Documentación Externa

source: Mixing tests in with regular code is not the only way to use ``doctest``. Examples embedded in external project documentation files, such as reStructuredText files, can be used as well.
es_419: La mezcla de pruebas con código regular no es la única manera de usar ``doctest``. También se pueden utilizar ejemplos incorporados en archivos de documentación de proyectos externos, como archivos reStructuredText.

source: The help for this sample module is saved to a separate file, ``doctest_in_help.txt``. The examples illustrating how to use the module are included with the help text, and ``doctest`` can be used to find and run them.
es_419: La ayuda para este módulo de ejemplo se guarda en un archivo separado, ``doctest_in_help.txt``. Los ejemplos que ilustran cómo usar el módulo se incluyen con el texto de ayuda, y ``doctest`` se puede usar para encontrarlos y ejecutarlos.

source: The tests in the text file can be run from the command line, just as with the Python source modules.
es_419: Las pruebas en el archivo de texto se pueden ejecutar desde la línea de comandos, al igual que con los módulos fuente de Python.

source: Normally ``doctest`` sets up the test execution environment to include the members of the module being tested, so the tests do not need to import the module explicitly. In this case, however, the tests are not defined in a Python module, and ``doctest`` does not know how to set up the global namespace, so the examples need to do the import work themselves. All of the tests in a given file share the same execution context, so importing the module once at the top of the file is enough.
es_419: Normalmente ``doctest`` configura el entorno de ejecución de prueba para incluir los miembros del módulo que se está probando, por lo que las pruebas no necesitan importar el módulo explícitamente. En este caso, sin embargo, las pruebas no se definen en un módulo Python, y ``doctest`` no sabe cómo configurar el espacio de nombres global, por lo que los ejemplos necesitan hacer el trabajo de importación ellos mismos. Todas las pruebas en un archivo dado comparten el mismo contexto de ejecución, por lo que importar el módulo una vez en la parte superior del archivo es suficiente.

source: Running Tests
es_419: Ejecutando el Test

source: The previous examples all use the command line test runner built into ``doctest``. It is easy and convenient for a single module, but will quickly become tedious as a package spreads out into multiple files. There are several alternative approaches.
es_419: Los ejemplos anteriores usan el corredor de prueba de línea de comandos integrado en ``doctest``. Esto es fácil y conveniente para un solo módulo, pero pronto se convertirá en tedioso como un paquete que se propaga en múltiples archivos. Hay varios enfoques alternativos.

source: By Module
es_419: Por Módulo

source: The instructions to run ``doctest`` against the source can be included at the bottom of modules.
es_419: Las instrucciones para ejecutar ``doctest`` contra la fuente se pueden incluir en la parte inferior de los módulos.

source: Calling ``testmod()`` only if the current module name is ``__main__`` ensures that the tests are only run when the module is invoked as a main program.
es_419: Llamar ``testmod ()`` sólo si el nombre actual del módulo es ``__main__`` asegura que las pruebas sólo se ejecutan cuando el módulo se invoca como un programa principal.

source: The first argument to ``testmod()`` is a module containing code to be scanned for tests. A separate test script can use this feature to import the real code and run the tests in each module one after another.
es_419: El primer argumento de ``testmod ()`` es un módulo que contiene el código que se va a explorar para las pruebas. Un script de prueba independiente puede usar esta característica para importar el código real y ejecutar las pruebas en cada módulo uno después de otro.

source: A test suite can be constructed for the project by importing each module and running its tests.
es_419: Se puede construir una suite de pruebas para el proyecto importando cada módulo y ejecutando sus pruebas.

source: By File
es_419: Por Archivo

source: ``testfile()`` works in a way similar to ``testmod()``, allowing the tests to be invoked explicitly in an external file from within the test program.
es_419: ``Testfile ()`` funciona de manera similar a ``testmod ()``, permitiendo que las pruebas sean invocadas explícitamente en un archivo externo desde dentro del programa de prueba.

source: Both ``testmod()`` and ``testfile()`` include optional parameters to control the behavior of the tests through the ``doctest`` options. Refer to the standard library documentation for more details about those features -- most of the time they are not needed.
es_419: Ambos ``testmod ()`` y ``testfile ()`` incluyen parámetros opcionales para controlar el comportamiento de las pruebas a través de las opciones ``doctest``. Consulte la documentación de la biblioteca estándar para obtener más detalles sobre esas características, la mayoría de las veces no son necesarias.

source: Unittest Suite
es_419: Suite de pruebas de unidad
