Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/gettext/index.po
Languages: es_ar

source: gettext --- Message Catalogs
es_ar: gettext --- Catálogos de mensajes

source: Message catalog API for internationalization.
es_ar: API de catálogo de mensajes para la internacionalización.

source: The ``gettext`` module provides a pure-Python implementation compatible with the GNU **gettext** library for message translation and catalog management. The tools available with the Python source distribution enable you to extract messages from a set of source files, build a message catalog containing translations, and use that message catalog to display an appropriate message for the user at runtime.
es_ar: El módulo ``gettext`` proporciona una implementación puramente Python compatible con la biblioteca GNU **gettext** para la traducción de mensajes y la gestión de catálogos. Las herramientas disponibles con la distribución de fuentes de Python permiten extraer mensajes de un conjunto de archivos de origen, crear un catálogo de mensajes que contiene traducciones y utilizar ese catálogo de mensajes para mostrar un mensaje adecuado para el usuario en tiempo de ejecución.

source: Message catalogs can be used to provide internationalized interfaces for a program, showing messages in a language appropriate to the user. They can also be used for other message customizations, including "skinning" an interface for different wrappers or partners.
es_ar: Los catálogos de mensajes pueden utilizarse para proporcionar interfaces internacionalizadas para un programa, mostrando mensajes en un idioma apropiado para el usuario. También se pueden utilizar para otras personalizaciones de mensajes, incluyendo "despojar" una interfaz para diferentes envolturas o socios.

source: Although the standard library documentation says all of the necessary tools are included with Python, ``pygettext.py`` failed to extract messages wrapped in the ``ngettext`` call, even with the appropriate command line options. These examples use ``xgettext`` from the GNU **gettext** tool set, instead.
es_ar: Aunque la documentación estándar de la biblioteca dice que todas las herramientas necesarias se incluyen con Python, ``pygettext.py`` no extrae mensajes envueltos en la llamada ``ngettext``, incluso con las opciones de línea de comandos apropiadas. Estos ejemplos utilizan ``xgettext`` del conjunto de herramientas GNU **gettext**.

source: Translation Workflow Overview
es_ar: Visión General del trabajo de traducción

source: The process for setting up and using translations includes five steps.
es_ar: El proceso para configurar y usar traducciones incluye cinco pasos.

source: *Identify and mark up literal strings in the source code that contain messages to translate.*
es_ar: *Identificar y marcar las cadenas literales en el código fuente que contienen mensajes para traducir.*

source: Start by identifying the messages within the program source that need to be translated, and marking the literal strings so the extraction program can find them.
es_ar: Comience por identificar los mensajes dentro de la fuente del programa que necesitan ser traducidos, y marcando las cadenas literales para que el programa de extracción pueda encontrarlas.

source: *Extract the messages.*
es_ar: *Extraer los mensajes.*

source: After the translatable strings in the source are identified, use ``xgettext`` to extract them and create a ``.pot`` file, or *translation template*. The template is a text file with copies of all of the strings identified and placeholders for their translations.
es_ar: Después de identificar las cadenas traducibles en la fuente, utilice ``xgettext`` para extraerlas y crear un archivo ``.pot``, o *plantilla (template) de traducción*. La plantilla es un archivo de texto con copias de todas las cadenas identificadas y marcadores de posición para sus traducciones.

source: *Translate the messages.*
es_ar: *Traducir los mensajes.*

source: Give a copy of the ``.pot`` file to the translator, changing the extension to ``.po``. The ``.po`` file is an editable source file used as input for the compilation step. The translator should update the header text in the file and provide translations for all of the strings.
es_ar: Entregue una copia del archivo ``.pot`` al traductor, cambiando la extensión a ``.po``. El archivo ``.po`` es un archivo de origen editable utilizado como entrada para el paso de compilación. El traductor debe actualizar el texto del encabezado en el archivo y proporcionar traducciones para todas las cadenas.

source: *"Compile" the message catalog from the translation.*
es_ar: *"Compilar" el catálogo de mensajes de la traducción.*

source: When the translator sends back the completed ``.po`` file, compile the text file to the binary catalog format using ``msgfmt``. The binary format is used by the runtime catalog lookup code.
es_ar: Cuando el traductor devuelve el archivo ``.po`` completo, compilar el archivo de texto al formato de catálogo binario usando ``msgfmt``. El formato binario es utilizado por el código de búsqueda del catálogo de tiempo de ejecución.

source: *Load and activate the appropriate message catalog at runtime.*
es_ar: *Cargar y activar el catálogo de mensajes adecuado en tiempo de ejecución.*

source: The final step is to add a few lines to the application to configure and load the message catalog and install the translation function. There are a couple of ways to do that, with associated trade-offs.
es_ar: El paso final es agregar algunas líneas a la aplicación para configurar y cargar el catálogo de mensajes e instalar la función de traducción. Hay un par de maneras de hacer eso, con concesiones apropiadas.

source: The rest of this section will examine those steps in a little more detail, starting with the code modifications needed.
es_ar: El resto de esta sección examinará esos pasos con un poco más de detalle, comenzando con las modificaciones de código necesarias.

source: Creating Message Catalogs from Source Code
es_ar: Creación de Catálogos de Mensajes desde el Código Fuente

source: ``gettext`` works by looking up literal strings in a database of translations, and pulling out the appropriate translated string. The usual pattern is to bind the appropriate lookup function to the name "``_``" (a single underscore character) so that the code is not cluttered with a lot of calls to functions with longer names.
es_ar: ``Gettext`` funciona mirando las cadenas literales en una base de datos de traducciones y sacando la cadena traducida apropiada. El patrón habitual es vincular la función de búsqueda apropiada al nombre "``_``" (un solo carácter de subrayado) para que el código no esté lleno de muchas llamadas a funciones con nombres más largos.

source: The message extraction program, ``xgettext``, looks for messages embedded in calls to the catalog lookup functions. It understands different source languages and uses an appropriate parser for each. If the lookup functions are aliased, or extra functions are added, give ``xgettext`` the names of additional symbols to consider when extracting messages.
es_ar: El programa de extracción de mensajes, ``xgettext``, busca mensajes incrustados en las llamadas a las funciones de búsqueda de catálogo. Comprende diferentes lenguajes de origen y utiliza un analizador apropiado para cada uno. Si las funciones de búsqueda están alias o se agregan funciones adicionales, dé a ``xgettext`` los nombres de símbolos adicionales que deben tenerse en cuenta al extraer mensajes.

source: This script has a single message ready to be translated.
es_ar: Este script tiene un solo mensaje listo para ser traducido.

source: The text ``"This message is in the script."`` is the message to be substituted from the catalog. Fallback mode is enabled, so if the script is run without a message catalog, the in-lined message is printed.
es_ar: El texto ``"Este mensaje está en la secuencia de comandos."`` Es el mensaje que se va a sustituir del catálogo. El modo de recuperación está habilitado, por lo que si se ejecuta el script sin un catálogo de mensajes, se imprimirá el mensaje.

source: The next step is to extract the message and create the ``.pot`` file, using ``pygettext.py`` or ``xgettext``.
es_ar: El siguiente paso es extraer el mensaje y crear el archivo ``.pot``, usando ``pygettext.py`` o ``xgettext``.

source: The output file produced contains the following content.
es_ar: El archivo de salida producido contiene el siguiente contenido.

source: Message catalogs are installed into directories organized by *domain* and *language*. The domain is provided by the application or library, and is usually a unique value like the application name. In this case, the domain in ``gettext_example.py`` is ``example_domain``. The language value is provided by the user's environment at runtime, through one of the environment variables ``LANGUAGE``, ``LC_ALL``, ``LC_MESSAGES``, or ``LANG``, depending on their configuration and platform. These examples were all run with the language set to ``en_US``.
es_ar: Los catálogos de mensajes se instalan en directorios organizados por *dominio* e *idioma*. El dominio es proporcionado por la aplicación o biblioteca y suele ser un valor único como el nombre de la aplicación. En este caso, el dominio en ``gettext_example.py`` es ``example_domain``. El valor del lenguaje es proporcionado por el entorno del usuario en tiempo de ejecución, a través de una de las variables de entorno ``LANGUAGE``, ``LC_ALL``, ``LC_MESSAGES`` o ``LANG``, dependiendo de su configuración y plataforma. Todos estos ejemplos se ejecutaron con el idioma establecido en ``es_ES``.

source: Now that the template is ready, the next step is to create the required directory structure and copy the template in to the right spot. The ``locale`` directory inside the PyMOTW source tree will serve as the root of the message catalog directory for these examples, but it is typically better to use a directory accessible system-wide so that all users have access to the message catalogs. The full path to the catalog input source is ``$localedir/$language/LC_MESSAGES/$domain.po``, and the actual catalog has the filename extension ``.mo``.
es_ar: Ahora que la plantilla está lista, el siguiente paso es crear la estructura de directorio necesaria y copiar la plantilla en el lugar correcto. El directorio ``locale`` dentro del árbol de fuentes PyMOTW servirá como raíz del directorio de catálogo de mensajes para estos ejemplos, pero normalmente es mejor usar un directorio accesible a nivel de sistema para que todos los usuarios tengan acceso a los catálogos de mensajes. El camino completo a la fuente de entrada del catálogo es ``$localedir/$language/LC_MESSAGES/$domain.po``, y el catálogo actual tiene la extensión ``.mo`` del nombre de archivo.

source: The catalog is created by copying ``example.pot`` to ``locale/en_US/LC_MESSAGES/example.po`` and editing it to change the values in the header and set the alternate messages. The result is shown next.
es_ar: El catálogo se crea copiando ``example.pot`` a ``locale/es_ES/LC_MESSAGES/example.po`` y editándolo para cambiar los valores en el encabezado y establecer los mensajes alternativos. El resultado se muestra a continuación.

source: locale/en_US/LC_MESSAGES/example.po
es_ar: locale/es_ES/LC_MESSAGES/example.po

source: The catalog is built from the ``.po`` file using ``msgformat``.
es_ar: El catálogo se construye a partir del archivo ``.po`` usando ``msgformat``.

source: The domain in ``gettext_example.py`` is ``example_domain``, but the file is called ``example.pot``. To have ``gettext`` find the right translation file, the names need to match.
es_ar: El dominio en ``gettext_example.py`` es ``example_domain``, pero el archivo se llama ``example.pot``. Para que ``gettext`` encuentre el archivo de traducción adecuado, los nombres deben coincidir.

source: Now when the script is run, the message from the catalog is printed instead of the in-line string.
es_ar: Ahora, cuando se ejecuta el script, se imprime el mensaje del catálogo en lugar de la cadena en línea.

source: Finding Message Catalogs at Runtime
es_ar: Encontrar catálogos de mensajes en tiempo de ejecución

source: As described earlier, the *locale directory* containing the message catalogs is organized based on the language with catalogs named for the *domain* of the program. Different operating systems define their own default value, but ``gettext`` does not know all of these defaults. It uses a default locale directory of ``sys.prefix + '/share/locale'``, but most of the time it is safer to always explicitly give a ``localedir`` value than to depend on this default being valid. The ``find()`` function is responsible for locating an appropriate message catalog at runtime.
es_ar: Como se describió anteriormente, el *directorio locale* que contiene los catálogos de mensajes se organiza en función del idioma con los catálogos denominados *domain* del programa. Los diferentes sistemas operativos definen su propio valor por defecto, pero ``gettext`` no conoce todos estos valores predeterminados. Utiliza un directorio de configuración regional predeterminado de ``sys.prefix + '/ share / locale'``, pero la mayoría de las veces es más seguro dar siempre un valor ``localedir`` que depender de que este valor predeterminado sea válido. La función ``find()`` es responsable de localizar un catálogo de mensajes apropiado en tiempo de ejecución.

source: The language portion of the path is taken from one of several environment variables that can be used to configure localization features (``LANGUAGE``, ``LC_ALL``, ``LC_MESSAGES``, and ``LANG``). The first variable found to be set is used. Multiple languages can be selected by separating the values with a colon (``:``). To see how that works, use a second message catalog to run a few experiments.
es_ar: La parte del idioma de la ruta se toma de una de varias variables de entorno que se pueden utilizar para configurar las características de localización (``LANGUAGE``, ``LC_ALL``, ``LC_MESSAGES``, y ``LANG``). Se utiliza la primera variable que se ha establecido. Se pueden seleccionar varios idiomas separando los valores con dos puntos (``:``). Para ver cómo funciona, utilice un segundo catálogo de mensajes para ejecutar algunos experimentos.

source: Although ``find()`` shows the complete list of catalogs, only the first one in the sequence is actually loaded for message lookups.
es_ar: Aunque ``find()`` muestra la lista completa de catálogos, sólo el primero de la secuencia se carga realmente para las búsquedas de mensajes.

source: Plural Values
es_ar: Valores Plurales

source: While simple message substitution will handle most translation needs, ``gettext`` treats pluralization as a special case. Depending on the language, the difference between the singular and plural forms of a message may vary only by the ending of a single word, or the entire sentence structure may be different. There may also be different forms depending on the level of plurality. To make managing plurals easier (and, in some cases, possible), there is a separate set of functions for asking for the plural form of a message.
es_ar: Mientras que la simple sustitución de mensajes se encargará de la mayoría de las necesidades de traducción, ``gettext`` trata la pluralización como un caso especial. Dependiendo del idioma, la diferencia entre las formas singular y plural de un mensaje puede variar sólo por el final de una sola palabra, o toda la estructura de la oración puede ser diferente. También puede haber formas diferentes dependiendo del nivel de pluralidad. Para facilitar la administración de plurales (y, en algunos casos, es posible), hay un conjunto de funciones separado para pedir la forma plural de un mensaje.

source: Use ``ngettext()`` to access the plural substitution for a message. The arguments are the messages to be translated and the item count.
es_ar: Utilice ``ngettext()`` para acceder a la sustitución plural de un mensaje. Los argumentos son los mensajes que se van a traducir y el número de elementos.

source: Since there are alternate forms to be translated, the replacements are listed in an array. Using an array allows translations for languages with multiple plural forms (for example, Polish has different forms indicating the relative quantity).
es_ar: Dado que hay formas alternativas a traducir, los reemplazos se enumeran en una matriz. El uso de una matriz permite traducciones para lenguajes con múltiples formas plurales (por ejemplo, el polaco tiene diferentes formas que indican la cantidad relativa).

source: In addition to filling in the translation strings, the library needs to be told about the way plurals are formed so it knows how to index into the array for any given count value. The line ``"Plural-Forms: nplurals=INTEGER; plural=EXPRESSION;\n"`` includes two values to replace manually. ``nplurals`` is an integer indicating the size of the array (the number of translations used) and ``plural`` is a C language expression for converting the incoming quantity to an index in the array when looking up the translation. The literal string ``n`` is replaced with the quantity passed to ``ungettext()``.
es_ar: Además de rellenar las cadenas de traducción, la biblioteca debe ser informada sobre la forma en que se forman los plurales, de modo que sabe cómo indexar en la matriz para cualquier valor de recuento dado. La línea ``"Plural-Forms: nplurals=INTEGER; plural=EXPRESSION;\n"` `incluye dos valores para reemplazar manualmente. ``nplurals`` es un entero que indica el tamaño de la matriz (el número de traducciones utilizadas) y ``plural`` es una expresión en lenguaje C para convertir la cantidad entrante en un índice en la matriz cuando se busca la traducción. La cadena literal ``n`` se sustituye por la cantidad que se pasa a ``ungettext ()``.

source: For example, English includes two plural forms. A quantity of ``0`` is treated as plural ("0 bananas"). The ``Plural-Forms`` entry is::
es_ar: Por ejemplo, en inglés se incluyen dos formas plurales. Una cantidad de ``0`` es tratada como plural ("0 bananas"). La entrada ``Plural-Forms`` es:

source: The singular translation would then go in position 0, and the plural translation in position 1.
es_ar: La traducción singular iría entonces en la posición 0, y la traducción plural en la posición 1.

source: locale/en_US/LC_MESSAGES/plural.po
es_ar: locale/es_ES/LC_MESSAGES/plural.po

source: Running the test script a few times after the catalog is compiled will demonstrate how different values of N are converted to indexes for the translation strings.
es_ar: Ejecutar el script de prueba un par de veces después de que el catálogo se compila demostrará cómo se convierten valores diferentes de N a índices para las cadenas de traducción.

source: Application vs. Module Localization
es_ar: Aplicación vs. Localización de Módulo

source: The scope of a translation effort defines how ``gettext`` is installed and used with a body of code.
es_ar: El alcance de un esfuerzo de traducción define cómo ``gettext`` se instala y se utiliza con un cuerpo de código.

source: Application Localization
es_ar: Localización de las aplicaciones

source: For application-wide translations, it is acceptable for the author to install a function like ``ngettext()`` globally using the ``__builtins__`` namespace, because they have control over the top-level of the application's code.
es_ar: Para traducciones a nivel de aplicación, es aceptable para el autor instalar una función como ``ngettext () `` globalmente usando el espacio de nombres ``__builtins__``, ya que tienen control sobre el nivel superior del código de la aplicación.

source: The ``install()`` function binds ``gettext()`` to the name ``_()`` in the ``__builtins__`` namespace. It also adds ``ngettext()`` and other functions listed in ``names``.
es_ar: La función ``install ()`` vincula ``gettext ()`` al nombre ``_ () `` en el espacio de nombres ``__builtins__``. También agrega ``ngettext () `` y otras funciones listadas en ``names``.

source: Module Localization
es_ar: Localización de Módulos

source: For a library or individual module, modifying ``__builtins__`` is not a good idea because it may introduce conflicts with an application global value. Instead, import or re-bind the names of translation functions by hand at the top of the module.
es_ar: Para una biblioteca o módulo individual, modificar ``__builtins__`` no es una buena idea porque puede introducir conflictos con un valor global de la aplicación. En su lugar, importe o vuelva a enlazar manualmente los nombres de las funciones de traducción en la parte superior del módulo.

source: Switching Translations
es_ar: Conmutando Traducciones

source: The earlier examples all use a single translation for the duration of the program. Some situations, especially web applications, need to use different message catalogs at different times, without exiting and resetting the environment. For those cases, the class-based API provided in ``gettext`` will be more convenient. The API calls are essentially the same as the global calls described in this section, but the message catalog object is exposed and can be manipulated directly, so that multiple catalogs can be used.
es_ar: Los ejemplos anteriores usan una sola traduccióndurante la ejecución del programa. Algunas situaciones, especialmente aplicaciones web, necesitan usar diferentes catálogos de mensajes en diferentes momentos, sin salir y restablecer el entorno. Para esos casos, la API basada en clases que se proporciona en ``gettext`` es más conveniente. Las llamadas de API son esencialmente las mismas que las llamadas globales descritas en esta sección, pero el objeto de catálogo de mensajes está expuesto y puede manipularse directamente, de modo que se pueden utilizar varios catálogos.

source: :mod:`locale` -- Other localization tools.
es_ar: :mod:`locale` -- Otras herramientas de localización.

source: `GNU gettext`_ -- The message catalog formats, API, etc. for this module are all based on the original gettext package from GNU. The catalog file formats are compatible, and the command line scripts have similar options (if not identical). The `GNU gettext manual <http://www.gnu.org/software/gettext/manual/gettext.html>`_ has a detailed description of the file formats and describes GNU versions of the tools for working with them.
es_ar: `GNU gettext`_ -- Los formatos de catálogo de mensajes, API, etc. para este módulo están basados en el paquete gettext original de GNU. Los formatos de archivo de catálogo son compatibles y los scripts de línea de comandos tienen opciones similares (si no idénticas). El manual `GNU gettext <http://www.gnu.org/software/gettext/manual/gettext.html>`_ tiene una descripción detallada de los formatos de archivo y describe las versiones GNU de las herramientas para trabajar con ellas.

source: `Plural forms <http://www.gnu.org/software/gettext/manual/gettext.html#Plural-forms>`__ -- Handling of plural forms of words and sentences in different languages.
es_ar: `Formas plurales <http://www.gnu.org/software/gettext/manual/gettext.html#Plural-forms>`__ -- Manejo de formas plurales de palabras y oraciones en diferentes idiomas.

source: `Internationalizing Python <http://legacy.python.org/workshops/1997-10/proceedings/loewis.html>`_ -- A paper by Martin von Löwis about techniques for internationalization of Python applications.
es_ar: `Internationalizing Python <http://legacy.python.org/workshops/1997-10/proceedings/loewis.html>`_ -- Un trabajo de Martin von Löwis sobre técnicas para la internacionalización de aplicaciones Python.
