Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/gettext/index.po
Languages: es_ar

source: `Django Internationalization <https://docs.djangoproject.com/en/dev/topics/i18n/>`_ -- Another good source of information on using gettext, including real-life examples.
es_ar: `Django Internationalization <https://docs.djangoproject.com/en/dev/topics/i18n/>`_ -- Otra buena fuente de información sobre el uso de gettext, incluyendo ejemplos de la vida real.
