Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/articles/text_processing.po
Languages: es_ar

source: Text Processing Tools
es_ar: Herramientas de Procesamiento de Texto

source: The string class is the most obvious text processing tool available to Python programmers, but there are plenty of other tools in the standard library to make text manipulation simpler.
es_ar: La clase string es la herramienta de procesamiento de texto más obvia a disposición de los programadores de Python, pero hay un montón de otras herramientas en la biblioteca estándar para realizar la manipulación de texto simple.

source: string module
es_ar: Modulo string

source: Old-style code will use functions from the :mod:`string` module, instead of methods of string objects. There is an equivalent method for each function from the module, and use of the functions is deprecated for new code.
es_ar: Código de estilo antiguo utilizará funciones del modulo :mod:`string`, en lugar de los métodos de objetos de cadena. Hay un método equivalente para cada función del módulo, y el uso de las funciones es obsoleto para un código nuevo.

source: Newer code may use a ``string.Template`` as a simple way to parameterize strings beyond the features of the string or unicode classes. While not as feature-rich as templates defined by many of the web frameworks or extension modules available on PyPI, ``string.Template`` is a good middle ground for user-modifiable templates where dynamic values need to be inserted into otherwise static text.
es_ar: Código reciente puede usar el ``string.Template`` como una forma sencilla de parametrizar cadenas más allá de las características de las clases de cadena o Unicode. Aunque no es tan rica en características como plantillas definidas por muchos de los frameworks web o módulos de extensión disponibles en PyPI, ``string.Template`` es un buen término medio para plantillas modificables por el usuario donde los valores dinámicos necesitan ser insertado en el texto de otra forma estática.

source: Text Input
es_ar: Entrada de texto

source: Reading from a file is easy enough, but if you're writing a line-by-line filter the :mod:`fileinput` module is even easier. The fileinput API calls for you to iterate over the ``input()`` generator, processing each line as it is yielded. The generator handles parsing command line arguments for file names, or falling back to reading directly from ``sys.stdin``. The result is a flexible tool your users can run directly on a file or as part of a pipeline.
es_ar: Lectura de un archivo es bastante fácil, pero si usted está escribiendo un filtrado línea por línea del modulo :mod:`fileinput` es aún más fácil. La API fileinput pide a iterar sobre el generador `` input ()`` , procesando cada línea que ya produjo. El generador maneja analizar los argumentos de línea de comandos para los nombres de archivo, o cayendo de nuevo a la lectura directa de ``sys.stdin``. El resultado es una herramienta flexible que los usuarios puedan ejecutar directamente en un archivo o como parte de una tubería.

source: Text Output
es_ar: salida de texto

source: The :mod:`textwrap` module includes tools for formatting text from paragraphs by limiting the width of output, adding indentation, and inserting line breaks to wrap lines consistently.
es_ar: El modulo :mod:`textwrap` incluye herramientas para dar formato al texto de los apartados al limitar el ancho de la producción, añadiendo sangría, e insertar saltos de línea para envolver líneas consistentemente.

source: Comparing Values
es_ar: Comparando valores

source: The standard library includes two modules related to comparing text values beyond the built-in equality and sort comparison supported by string objects. :mod:`re` provides a complete regular expression library, implemented largely in C for performance. Regular expressions are well-suited for finding substrings within a larger data set, comparing strings against a pattern (rather than another fixed string), and mild parsing.
es_ar: La biblioteca estándar incluye dos módulos relacionados con la comparación de los valores de texto mas allá de la incorporada en la comparación de igualdad y ordenamiento soportado por los objetos de cadena. :mod:`re` ofrece una completa biblioteca de expresiones regulares, implementado principalmente en C para el rendimiento. Las expresiones regulares son muy adecuados para la búsqueda de subcadenas dentro de un conjunto de datos mayor, comparar cadenas contra un patrón (en lugar de otra cadena fija), y el análisis leve.

source: :mod:`difflib`, on the other hand, shows you the actual differences between sequences of text in terms of the parts added, removed, or changed. The output of the comparison functions in :mod:`difflib` can be used to provide more detailed feedback to user about where changes occur in two inputs, how a document has changed over time, etc.
es_ar: :mod:`difflib`, por otro lado, muestra las diferencias reales entre las secuencias de texto en términos de las partes añadidas, eliminado o cambiado. La salida de las funciones de comparación en :mod:`difflib` se puede utilizar para proporcionar información más detallada al usuario acerca de dónde se producen cambios en dos entradas, cómo un documento que ha cambiado con el tiempo, etc.
