Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/locale/index.po
Languages: es_ar

source: locale --- Cultural Localization API
es_ar: locale -- API de Localización Cultural

source: Format and parse values that depend on location or language.
es_ar: El formato y análisis de valores dependen de la ubicación o el idioma.

source: The ``locale`` module is part of Python's internationalization and localization support library. It provides a standard way to handle operations that may depend on the language or location of a user. For example, it handles formatting numbers as currency, comparing strings for sorting, and working with dates. It does not cover translation (see the :mod:`gettext` module) or Unicode encoding (see the :mod:`codecs` module).
es_ar: El módulo ``locale`` forma parte de la biblioteca de soporte de internacionalización y localización de Python. Proporciona una forma estándar de manejar operaciones que pueden depender del idioma o la ubicación de un usuario. Por ejemplo, maneja los números de formato como moneda, comparando cadenas para ordenar y trabajando con fechas. No cubre la traducción (ver el módulo :mod:`gettext`) ni la codificación Unicode (ver el módulo :mod:`codecs`).

source: Changing the locale can have application-wide ramifications, so the recommended practice is to avoid changing the value in a library and to let the application set it one time. In the examples in this section, the locale is changed several times within a short program to highlight the differences in the settings of various locales. It is far more likely that an application will set the locale once as it starts up or when a web request is received and not change it.
es_ar: Cambiando la configuración regional puede tener ramificaciones de toda la aplicación, por lo que la práctica recomendada es evitar cambiar el valor en una biblioteca y dejar que la aplicación lo establezca una vez. En los ejemplos de esta sección, la configuración regional se cambia varias veces dentro de un programa corto para resaltar las diferencias en la configuración de varios entornos locales. Es mucho más probable que una aplicación establezca la configuración regional una vez que se inicie o cuando se reciba una solicitud web y no la cambie.

source: This section covers some of the high-level functions in the ``locale`` module. There are others which are lower level (``format_string()``) or which relate to managing the locale for an application (``resetlocale()``).
es_ar: Esta sección cubre algunas de las funciones de alto nivel del módulo ``locale``. Hay otros que son de nivel inferior (``format_string ()``) o que se relacionan con la gestión de la configuración regional de una aplicación (``resetlocale()``).

source: Probing the Current Locale
es_ar: Probando el Locale Actual

source: The most common way to let the user change the locale settings for an application is through an environment variable (``LC_ALL``, ``LC_CTYPE``, ``LANG``, or ``LANGUAGE``, depending on the platform). The application then calls ``setlocale()`` without a hard-coded value, and the environment value is used.
es_ar: La forma más común de permitir que el usuario cambie la configuración regional de una aplicación es a través de una variable de entorno (``LC_ALL``, ``LC_CTYPE``, ``LANG`` o ``LANGUAGE``, dependiendo de la plataforma). La aplicación entonces llama ``setlocale()`` sin un valor codificado, y se utiliza el valor del entorno.

source: The ``localeconv()`` method returns a dictionary containing the locale's conventions. The full list of value names and definitions is covered in the standard library documentation.
es_ar: El método ``localeconv()`` devuelve un diccionario que contiene las convenciones de la configuración regional. La lista completa de nombres de valores y definiciones se incluye en la documentación estándar de la biblioteca.

source: A Mac running OS X 10.11.6 with all of the variables unset produces this output:
es_ar: Un equipo Mac que ejecuta OS X 10.11.6 con todas las variables desactivadas produce este resultado:

source: Running the same script with the ``LANG`` variable set shows how the locale and default encoding change.
es_ar: La ejecución de la misma secuencia de comandos con el conjunto de variables ``LANG`` muestra cómo cambia la configuración regional y la codificación predeterminada.

source: The United States (``en_US``):
es_ar: EE.UU. (``en_US``):

source: France (``fr_FR``):
es_ar: Francia (``fr_FR``):

source: Spain (``es_ES``):
es_ar: España (``es_ES``):

source: Poland (``pl_PL``):
es_ar: Polonia (``pl_PL``):

source: Currency
es_ar: Moneda

source: The earlier example output shows that changing the locale updates the currency symbol setting and the character to separate whole numbers from decimal fractions. This example loops through several different locales to print a positive and negative currency value formatted for each locale.
es_ar: La salida de ejemplo anterior muestra que al cambiar la configuración regional se actualiza la configuración de símbolo de moneda y el carácter para separar números enteros de fracciones decimales. Este ejemplo realiza un bucle a través de varias configuraciones diferentes para imprimir un valor de moneda positivo y negativo con formato para cada configuración regional.

source: The output is this small table:
es_ar: La salida es esta pequeña tabla:

source: Formatting Numbers
es_ar: Formateo de números

source: Numbers not related to currency are also formatted differently depending on the locale. In particular, the ``grouping`` character used to separate large numbers into readable chunks changes.
es_ar: Los números no relacionados con la moneda también se formatean de forma diferente dependiendo de la configuración regional. En particular, el carácter ``grouping`` utilizado para separar grandes números en trozos legibles.

source: To format numbers without the currency symbol, use ``format()`` instead of ``currency()``.
es_ar: Para dar formato a números sin el símbolo de moneda, utilice ``format()`` en lugar de ``currency()``.

source: To convert locale-formatted numbers to a normalized locale-agnostic format, use ``delocalize()``.
es_ar: Para convertir números con formato regional a un formato agnóstico normalizado, utilice ``delocalize()``.

source: Grouping punctuation is removed and the decimal separator is converted to always be a ``.``.
es_ar: Se elimina la puntuación de agrupación y se convierte el separador decimal para que siempre sea un `` .``.

source: Parsing Numbers
es_ar: Analizando Números

source: Besides generating output in different formats, the ``locale`` module helps with parsing input. It includes ``atoi()`` and ``atof()`` functions for converting the strings to integer and floating point values based on the locale's numerical formatting conventions.
es_ar: Además de generar resultados en diferentes formatos, el módulo ``locale`` ayuda con la entrada de análisis. Incluye las funciones ``atoi()`` y ``atof()`` para convertir las cadenas en enteros y valores en coma flotante basados en las convenciones de formato numérico de la configuración regional.

source: The grouping and decimal separator values of the locale are recognized by the parser.
es_ar: Los valores de agrupación y de separación decimal de la configuración regional son reconocidos por el analizador.

source: Dates and Times
es_ar: Fechas y Horas

source: Another important aspect of localization is date and time formatting.
es_ar: Otro aspecto importante de la localización es el formato de fecha y hora.

source: This example uses the date formatting string for the locale to print the current date and time.
es_ar: En este ejemplo utiliza la cadena de formato de fecha para la configuración regional para imprimir la fecha y la hora actuales.

source: :ref:`Python 2 to 3 porting notes for locale <porting-locale>`
es_ar: :ref:`Python 2 a 3 notas de portado para locale <porting-locale>`

source: :mod:`gettext` -- Message catalogs for translations.
es_ar: :mod:`gettext` -- Catálogos de mensajes para traducciones.
