Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/asyncore/index.po
Languages: es_ar

source: asyncore -- Asynchronous I/O handler
es_ar: asyncore -- Manejador asincrónico de I/O

source: Asynchronous I/O handler
es_ar: Manejador asincrónico de I/O

source: 1.5.2 and later
es_ar: 1.5.2 y posterior

source: The asyncore module includes tools for working with I/O objects such as sockets so they can be managed asynchronously (instead of, for example, using threads). The main class provided is :class:`dispatcher`, a wrapper around a socket that provides hooks for handling events like connecting, reading, and writing when invoked from the main loop function, :func:`loop`.
es_ar: El módulo de asyncore incluye herramientas para trabajar con objetos de I/O como zócalos por lo que pueden ser manejadas de forma asincrónica (en vez de, por ejemplo, utilizando hilos). La clase principal es :class:'dispatcher', un contenedor alrededor de un zócalo que ofrece ganchos para controlar eventos como conexión, lectura y escritura cuando se invoca la función de bucle principal :func:'loop'.

source: Clients
es_ar: Clientes

source: To create an asyncore-based client, subclass :class:`dispatcher` and provide implementations for creating the socket, reading, and writing. Let's examine this HTTP client, based on the one from the standard library documentation.
es_ar: Para crear un cliente de asyncore, subclase :class:'dispatcher' y proporcionar implementaciones para crear la toma, lectura y escritura. Vamos a examinar a este cliente HTTP, basado en el de la documentación de la biblioteca estándar.

source: First, the socket is created in ``__init__()`` using the base class method ``create_socket()``. Alternative implementations of the method may be provided, but in this case we want a TCP/IP socket so the base class version is sufficient.
es_ar: En primer lugar, el socket se crea en ''__init__()'' usando el método de clase base ''create_socket()''. Implementaciones alternativas del método se pueden proporcionar, pero en este caso queremos un socket TCP/IP para que la versión de clase base es suficiente.

source: The ``handle_connect()`` hook is present simply to illustrate when it is called. Other types of clients that need to do some sort of hand-shaking or protocol negotiation should do the work in ``handle_connect()``.
es_ar: El gancho de '' handle_connect()'' es simplemente para ilustrar cuando se llama. Otros tipos de clientes que necesitan hacer algún tipo de apretón de manos o negociación de protocolo deben trabajar en '' handle_connect()''.

source: ``handle_close()`` is similarly presented for the purposes of showing when the method is called. The base class version closes the socket correctly, so if you don't need to do extra cleanup on close you can leave the method out.
es_ar: '' handle_close()'' de manera similar es presentado para los propósitos de mostrar cuando se llama al método. La versión de clase base cierra la toma correctamente, así que si usted no necesita hacer limpieza adicional de cierre puede dejar el método hacia fuera.

source: The asyncore loop uses ``writable()`` and its sibling method ``readable()`` to decide what actions to take with each dispatcher. Actual use of poll() or select() on the sockets or file descriptors managed by each dispatcher is handled inside the :mod:`asyncore` code, so you don't need to do that yourself. Simply indicate whether the dispatcher cares at all about reading or writing. In the case of this HTTP client, ``writable()`` returns True as long as there is data from the request to send to the server. ``readable()`` always returns True because we want to read all of the data.
es_ar: El bucle asyncore utiliza ``writable() `` y su método hermano ``readable()`` para decidir las acciones a tomar en cada despachador. El uso real de poll () o select() en las tomas o descriptores de archivos gestionados por cada despachador se maneja dentro del código mod:`asyncore`, por lo que no tiene que hacerlo usted mismo. Simplemente indique si el despachador le importa en absoluto acerca de la lectura o la escritura. En el caso de este cliente HTTP, ``writable() `` devuelve Verdadero, siempre y cuando no hay datos de la solicitud para enviar al servidor. `` readable () `` siempre devuelve Verdadero porque queremos leer todos los datos.

source: Each time through the loop when ``writable()`` responds positively, ``handle_write()`` is invoked. In this version, the HTTP request string that was built in ``__init__()`` is sent to the server and the write buffer is reduced by the amount successfully sent.
es_ar: Cada vez que a través del bucle cuando `` writable () `` responde positivamente, `` handle_write () `` se invoca. En esta versión, la cadena de petición HTTP que se construyó en `` __init __ () `` se envía al servidor y el búfer de escritura se reduce en la cantidad enviada correctamente.

source: Similarly, when ``readable()`` responds positively and there is data to read, ``handle_read()`` is invoked.
es_ar: Del mismo modo, cuando `` readable () `` responde positivamente y hay datos para leer, `` handle_read () `` se invoca.

source: The example below the ``__main__`` test configures logging for debugging then creates two clients to download two separate web pages. Creating the clients registers them in a "map" kept internally by asyncore. The downloading occurs as the loop iterates over the clients. When the client reads 0 bytes from a socket that seems readable, the condition is interpreted as a closed connection and ``handle_close()`` is called.
es_ar: El ejemplo debajo de la prueba `` __main__`` configura el registro para la depuración, entonces crea dos clientes para descargar dos páginas web diferentes. Creación de los clientes los registra en un "mapa" guardado internamente por asyncore. La descarga se produce como las iteraciones de bucle a través de los clientes. Cuando el cliente lee 0 bytes desde un socket que parece legible, la condición se interpreta como una conexión cerrada y `` handle_close () `` se llama.

source: One example of how this client app may run is:
es_ar: Un ejemplo de cómo esta aplicación cliente puede ejecutar es:

source: Servers
es_ar: Servidores

source: The example below illustrates using asyncore on the server by re-implementing the EchoServer from the :mod:`SocketServer` examples. There are three classes: ``EchoServer`` receives incoming connections from clients and creates ``EchoHandler`` instances to deal with each. The ``EchoClient`` is an asyncore dispatcher similar to the HttpClient defined above.
es_ar: El siguiente ejemplo ilustra el uso de asyncore en el servidor por la re-implementación del Echoserver de los ejemplos de mod:`SocketServer`. Hay tres clases: `` EchoServer`` recibe las conexiones entrantes de los clientes y crea una instancia `` EchoHandler`` para hacer frente a cada uno. El `` EchoClient`` es un despachador de asyncore similar a la HttpClient definido anteriormente.

source: The EchoServer and EchoHandler are defined in separate classes because they do different things. When EchoServer accepts a connection, a new socket is established. Rather than try to dispatch to individual clients within EchoServer, an EchoHandler is created to take advantage of the socket map maintained by asyncore.
es_ar: El Echoserver y EchoHandler se definen en clases separadas porque hacen cosas diferentes. Cuando Echoserver acepta una conexión, se establece un nuevo socket. En lugar de tratar de enviar a los clientes individuales dentro Echoserver, se crea una EchoHandler aprovechar el mapa toma mantenida por asyncore.

source: In this example the server, handler, and client objects are all being maintained in the same socket map by asyncore in a single process. To separate the server from the client, simply instantiate them from separate scripts and run ``asyncore.loop()`` in both. When a dispatcher is closed, it is removed from the map maintained by asyncore and the loop exits when the map is empty.
es_ar: En este ejemplo, todos se mantienen, los servidores, manejador y objetos de cliente en el mismo mapa zócalo asyncore en un solo proceso. Para separar el servidor desde el cliente, sólo tiene que crear instancias de ellos de secuencias de comandos y ejecutar ``asyncore.loop () ``, por separado. Cuando un despachador está cerrado, se elimina del mapa mantenido por asyncore y el bucle termina cuando el mapa está vacío.

source: Working with Other Event Loops
es_ar: Trabajar con otros bucles de eventos

source: It is sometimes necessary to integrate the asyncore event loop with an event loop from the parent application. For example, a GUI application would not want the UI to block until all asynchronous transfers are handled -- that would defeat the purpose of making them asynchronous. To make this sort of integration easy, ``asyncore.loop()`` accepts arguments to set a timeout and to limit the number of times the loop is run. We can see their effect on the client by re-using HttpClient from the first example.
es_ar: A veces es necesario para integrar el bucle de eventos asyncore con un bucle de eventos de la aplicación principal. Por ejemplo, una aplicación GUI no querría bloquear la interfaz de usuario hasta que todas las transferencias asíncronas se manejen - que anule el propósito de hacerlos asíncronos. Para hacer este tipo de integración fácil, ``asyncore.loop()`` acepta argumentos para establecer un tiempo de espera y para limitar el número de veces que se ejecuta el bucle. Podemos ver su efecto en el cliente reutilizando HttpClient del primer ejemplo.

source: Here we see that the client is only asked to read or data once per call into ``asyncore.loop()``. Instead of our own ``while`` loop, we could call ``asyncore.loop()`` like this from a GUI toolkit idle handler or other mechanism for doing a small amount of work when the UI is not busy with other event handlers.
es_ar: Aquí vemos que el cliente sólo se le pide que lea o los datos una vez por llamada a `` asyncore.loop () ``. En lugar de nuestro propio bucle ``while``, podríamos llamar ``asyncore.loop()`` así desde un controlador inactivo GUI u otro mecanismo para hacer una pequeña cantidad de trabajo cuando la interfaz de usuario no está ocupado con otro evento de manejadores.

source: Working with Files
es_ar: Trabajando con archivos

source: Normally you would want to use asyncore with sockets, but there are times when it is useful to read files asynchronously, too (to use files when testing network servers without requiring the network setup, or to read or write large data files in parts). For these situations, asyncore provides the :class:`file_dispatcher` and :class:`file_wrapper` classes.
es_ar: Normalmente se desea utilizar asyncore con sockets, pero hay momentos en que es útil leer archivos de forma asíncrona, también (para usar archivos al probar los servidores de red sin necesidad de configuración de la red, o para leer o escribir archivos de datos de gran tamaño en partes). Para estas situaciones, asyncore proporciona la :class:`file_dispatcher` y :class:`clases file_wrapper`.

source: This example was tested under Python 2.5.2, so I am using ``os.open()`` to get a file descriptor for the file. For Python 2.6 and later, ``file_dispatcher`` automatically converts anything with a ``fileno()`` method to a file descriptor.
es_ar: Este ejemplo fue probado bajo Python 2.5.2, así que estoy usando `` os.open () `` para obtener un descriptor de archivo para el archivo. Para Python 2.6 y posteriores, `` file_dispatcher`` convierte automáticamente cualquier cosa con un método `` fileno () `` a un descriptor de archivo.

source: The standard library documentation for this module.
es_ar: La documentación de la biblioteca estándar para este módulo.

source: The asynchat module builds on asyncore to make it easier to create clients and servers communicate by passing messages back and forth using a set protocol.
es_ar: El módulo asynchat basa en asyncore para que sea más fácil para crear clientes y servidores se comunican mediante el paso de mensajes de ida y vuelta usando un protocolo establecido.

source: The SocketServer module article includes another example of the EchoServer with threading and forking variants.
es_ar: El artículo módulo SocketServer incluye otro ejemplo de la Echoserver con hilos y las variantes que se bifurcan.
