Repository: UniversidadDelEste/pymotw3
Catalog: locale/*/LC_MESSAGES/os/index.po
Languages: es

source: There are many variations of ``exec()``, depending on the form in which the arguments are available, whether the path and environment of the parent process should be copied to the child, etc. For all variations, the first argument is a path or filename and the remaining arguments control how that program runs. They are either passed as command line arguments or override the process "environment" (see ``os.environ`` and ``os.getenv``). Refer to the library documentation for complete details.
es: Hay muchas variaciones de ``exec()``, dependiendo de la forma en la que los argumentos están disponibles, si la ruta y el entorno del proceso padre deben ser copiados al hijo, etc. Para todas las variaciones, el primer argumento es una ruta de acceso o nombre de archivo y los argumentos restantes controlan cómo se ejecuta ese programa. Se pasan como argumentos de línea de comandos o anulan el proceso "environment" (ver ``os.environ`` y ``os.getenv``). Consulte la documentación de la biblioteca para obtener detalles completos.

source: Waiting for Child Processes
es: Esperando por Procesos Hijos

source: Many computationally intensive programs use multiple processes to work around the threading limitations of Python and the global interpreter lock. When starting several processes to run separate tasks, the master will need to wait for one or more of them to finish before starting new ones, to avoid overloading the server. There are a few different ways to do that using ``wait()`` and related functions.
es: Muchos programas computacionalmente intensivos utilizan múltiples procesos para trabajar en torno a las limitaciones de subprocesamiento de Python y el bloqueo de intérprete global. Al iniciar varios procesos para ejecutar tareas independientes, el maestro tendrá que esperar a que uno o varios terminen antes de iniciar otros nuevos, para evitar sobrecargar el servidor. Hay algunas maneras diferentes de hacer eso usando ``wait()`` y funciones relacionadas.

source: When it does not matter which child process might exit first, use ``wait()``. It returns as soon as any child process exits.
es: Cuando no importa qué proceso secundario salga primero, use ``wait()``. Retorna tan pronto como cualquier proceso hijo salga.

source: The return value from ``wait()`` is a tuple containing the process id and exit status combined into a 16-bit value. The low byte is the number of the signal that killed the process, and the high byte is the status code returned by the process when it exited.
es: El valor de retorno de ``wait()`` es una tupla que contiene el ID de proceso y el estado de salida combinados en un valor de 16 bits. El byte bajo es el número de la señal que mató el proceso, y el byte alto es el código de estado devuelto por el proceso cuando salió.

source: To wait for a specific process, use ``waitpid()``.
es: Para esperar un proceso específico, use ``waitpid()``.

source: Pass the process id of the target process, and ``waitpid()`` blocks until that process exits.
es: Pase el ID del proceso de destino y ``waitpid()`` bloquea hasta que el proceso salga.

source: ``wait3()`` and ``wait4()`` work in a similar manner, but return more detailed information about the child process with the pid, exit status, and resource usage.
es: ``wait3()`` y ``wait4()`` funcionan de manera similar, pero devuelven información más detallada sobre el proceso hijo con el pid, el estado de salida y el uso de recursos.

source: Spawning New Processes
es: Engendrando Nuevos Procesos

source: As a convenience, the ``spawn()`` family of functions handles the ``fork()`` and ``exec()`` in one statement:
es: Convenientemente, la familia de funciones ``spawn()`` maneja ``fork()`` y ``exec()`` en una instrucción:

source: The first argument is a mode indicating whether or not to wait for the process to finish before returning. This example waits. Use ``P_NOWAIT`` to let the other process start, but then resume in the current process.
es: El primer argumento es un modo que indica si se espera o no que el proceso termine antes de volver. Este ejemplo espera. Utilice ``P_NOWAIT`` para dejar que el otro proceso inicie, pero luego reanude en el proceso actual.

source: Operating System Error Codes
es: Códigos de error del sistema operativo

source: Error codes defined by the operating system and managed in the :mod:`errno` module can be translated to message strings using ``strerror()``.
es: Los códigos de error definidos por el sistema operativo y gestionados en el módulo :mod:`errno` pueden traducirse a cadenas de mensajes utilizando ``strerror()``.

source: This example shows the messages associated with some error codes that come up frequently.
es: Este ejemplo muestra los mensajes asociados con algunos códigos de error que aparecen con frecuencia.

source: :ref:`Python 2 to 3 porting notes for os <porting-os>`
es: :ref:`Notas sobre portar Python 2 a 3 para os <porting-os>`

source: :mod:`signal` -- The section on the ``signal`` module goes over signal handling techniques in more detail.
es: :mod:`signal` -- La sección del módulo ``signal`` revisa más detalladamente las técnicas de manejo de señales.

source: :mod:`subprocess` -- The ``subprocess`` module supersedes ``os.popen()``.
es: :mod:`subprocess` -- El módulo ``subprocess`` sustituye a ``os.popen()``.

source: :mod:`multiprocessing` -- The ``multiprocessing`` module makes working with extra processes easier.
es: :mod:`multiprocesamiento` -- El módulo ``multiprocesamiento`` facilita el trabajo con procesos adicionales.

source: :mod:`tempfile` -- The ``tempfile`` module for working with temporary files.
es: :mod:`tempfile` -- El módulo ``tempfile`` para trabajar con archivos temporales.

source: :ref:`shutil-directory-functions` -- The :mod:`shutil` module also includes functions for working with directory trees.
es: :ref:`shutil-directory-functions` -- El módulo :mod:`shutil` también incluye funciones para trabajar con árboles de directorios.

source: `Speaking UNIX, Part 8. <http://www.ibm.com/developerworks/aix/library/au-speakingunix8/index.html>`__ -- Learn how UNIX multitasks.
es: `Speaking UNIX, Part 8. <http://www.ibm.com/developerworks/aix/library/au-speakingunix8/index.html>`__ -- Aprenda sobre multitareas en UNIX.

source: `Standard streams <https://en.wikipedia.org/wiki/Standard_streams>`__ -- For more discussion of stdin, stdout, and stderr.
es: `Standard streams <https://en.wikipedia.org/wiki/Standard_streams>`__ -- Para más información de stdin, stdout, and stderr.

source: `Delve into Unix Process Creation <http://www.ibm.com/developerworks/aix/library/au-unixprocess.html>`__ -- Explains the life cycle of a Unix process.
es: `Delve into Unix Process Creation <http://www.ibm.com/developerworks/aix/library/au-unixprocess.html>`__ -- Explica el ciclo de vida de un proceso Unix.

source: *Advanced Programming in the UNIX(R) Environment* By W. Richard Stevens and Stephen A. Rago. Published by Addison-Wesley Professional, 2005. ISBN-10: 0201433079 -- This book covers working with multiple processes, such as handling signals, closing duplicated file descriptors, etc.
es: *Advanced Programming in the UNIX(R) Environment* Por W. Richard Stevens y Stephen A. Rago. Publicado por Addison-Wesley Professional, 2005. ISBN-10: 0201433079 -- Este libro cubre trabajo con múltiples procesos, tales como manejar señales, cerrar descriptores de archivos duplicados, etc.
